{"organizations": [], "uuid": "63e512192b0c172ebced21903b53dbd98db3d541", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 666, "shares": 666, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moviefone.com", "main_image": "https://s.aolcdn.com/dims-shared/dims3/GLOB/crop/1366x723+0+0/resize/660x350!/format/jpg/quality/85/https://s.aolcdn.com/hss/storage/midas/8e5b5826e5a46ad79f3553ffb5530068/204760751/INTRO_WinLose.jpg", "site_section": "http://news.moviefone.ca/rss.xml", "section_title": "Moviefone News RSS Feed - Moviefone.com", "url": "https://www.moviefone.com/2017/01/02/box-office-2016-winners-and-losers/", "country": "CA", "domain_rank": 5287, "title": "The 8 Biggest Box Office Winners (and Losers) of 2016", "performance_score": 6, "site": "moviefone.com", "participants_count": 1, "title_full": "The 8 Biggest Box Office Winners (and Losers) of 2016", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-02T12:00:00.000+02:00", "replies_count": 0, "uuid": "63e512192b0c172ebced21903b53dbd98db3d541"}, "author": "Gary Susman", "url": "https://www.moviefone.com/2017/01/02/box-office-2016-winners-and-losers/", "ord_in_thread": 0, "title": "The 8 Biggest Box Office Winners (and Losers) of 2016", "locations": [], "entities": {"persons": [{"name": "gary susman", "sentiment": "negative"}, {"name": "pete", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "ryan gosling", "sentiment": "none"}, {"name": "johnny depp", "sentiment": "none"}, {"name": "melissa mccarthy", "sentiment": "none"}, {"name": "will smith", "sentiment": "none"}, {"name": "tom hanks", "sentiment": "none"}, {"name": "amy adams", "sentiment": "none"}, {"name": "emma stone", "sentiment": "none"}, {"name": "james franco", "sentiment": "none"}, {"name": "idris elba did", "sentiment": "none"}, {"name": "jennifer lawrence", "sentiment": "none"}, {"name": "felicity jones", "sentiment": "none"}, {"name": "chris pratt", "sentiment": "none"}, {"name": "brad pitt", "sentiment": "none"}, {"name": "ben stiller", "sentiment": "none"}, {"name": "jake gyllenhaal", "sentiment": "none"}], "locations": [{"name": "north america", "sentiment": "none"}, {"name": "disney the house that walt built", "sentiment": "none"}, {"name": "denzel washington", "sentiment": "none"}, {"name": "hollywood", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "biggest box office winners", "sentiment": "negative"}, {"name": "pixar", "sentiment": "none"}, {"name": "bfg", "sentiment": "none"}, {"name": "disney", "sentiment": "none"}, {"name": "hollywood stars", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "by Gary Susman \nSure, 2016's domestic box office did hit a record $11.3 billion, up a modest 1.7 percent from 2015's record take. But that doesn't account for the inflation in the average ticket price -- $8.61 this year, up 18 cents from 2015 -- which means the number of tickets sold this year, 1.31 billion, was down a hair from a year ago, when theaters sold six million more tickets. \nIn fact, the total number of tickets sold has been slipping ever since the peak year of 2002 (1.58 billion tickets). \nThe current weekend is a pretty good snapshot of the year as a whole. \" Rogue One: A Star Wars Story \" topped the charts for a third straight weekend with an estimated $50 million (for a total of more than $400 million domestic to date). That made it 2016's second highest-grossing film, surpassing \"Captain America: Civil War.\" \nLooking at these movies, as well as the rest of the year, it becomes easier to find trends amid the box office confusion of 2016 and declare some clear winners and losers. \nWINNERS: \n1. Star Wars Along with \"Rogue One's\" earnings so far, and \"The Force Awakens\" playing into the early months of 2016, the franchise accounts for a solid $700 million toward the year's total take in North America. We've never had a year with two \"Star Wars\" movies in the multiplex before, which paves the way for \" Episode VIII \" in December 2017. \n2. Disney The House That Walt Built was far and away the market leader this year, both globally and domestically. With \"Star Wars,\" Marvel, Pixar, and live-action remakes of its animated library, the studio has hit upon several winning formulas, enough to power it past $7 billion globally this year. \nDisney scored four billion-dollar movies and six of this year's ten biggest domestic hits. Not everything worked, but the big smashes were more than big enough to make up for the extravagant flops -- sorry not sorry, \"Alice Through the Looking Glass\" and \"The BFG.\" \n3. China Remember what a huge flop \" Warcraft \" seemed to be earlier this summer? It made only $47 million here, but it was a massive hit abroad, earning $386 million. \nThe largest chunk of that change came from China ($221 million), a market whose taste in movies is now, arguably, more important than Americans' taste as far as determining which films Hollywood greenlights. Of course, if President-elect Trump goes all protectionist on trade with China, that country may respond by limiting Hollywood imports, which would mean fewer \"Warcrafts\" getting made. A win-win for everybody! \n4. Talking Animals \"Finding Dory,\" \"The Secret Life of Pets,\" \"The Jungle Book,\" and \"Zootopia\" were all among the year's top 10 movies. Current hit \"Sing\" is in the top 20, with $177 million to date. \n5. Idris Elba Did any actor have a better box office year in 2016? With \"Zootopia,\" \"The Jungle Book,\" \"Finding Dory,\" and \"Star Trek Beyond,\" his movies made $1.35 billion in North America. Granted, he's seen on camera in just one of those films, but still, his name in the credits now seems to be a sign that the movie is going to be a well-crafted popcorn entertainment. \nLOSERS: \n6. Bad Sequels \"Alice Through the Looking Glass,\" \"Independence Day: Resurgence,\" \"Neighbors 2: Sorority Rising,\" \"Teenage Mutant Ninja Turtles: Out of the Shadows,\" \"The Divergent Series: Allegiant,\" \"Now You See Me 2,\" \"Zoolander 2,\" \"Bad Santa 2,\" and many others flopped because either you didn't like them or want them. \nSame was true for some uninspired remakes, including \"Ghostbusters,\" \"Ben-Hur,\" and \"Pete's Dragon.\" None of this is going to stop the studios from betting the farm on sequels: they're still easier to market than unfamiliar original titles, and they're still likely to make money if they're done right. A big \"if,\" to be sure. \n7. Hollywood Stars Aren't a Sure Thing to Put Butts in Seats More than ever, it became apparent that marquee names alone aren't enough to sell a movie, and they're certainly not enough to turn a dog of a film into a thoroughbred. \n\" Passengers \" is currently flailing despite the presence of Jennifer Lawrence and Chris Pratt (in two weeks, it's earned back just $61 million of its $110 million budget), and James Franco couldn't sell \"Why Him?\" (an estimated $10 million this weekend, for a total of $37.6 million to date, though that one cost just $38 million to make).Throughout 2016, Johnny Depp, Brad Pitt, Ben Stiller, Will Smith, Melissa McCarthy, and other A-listers failed to interest ticketbuyers in their latest weak offerings. Tom Hanks helped make the well-liked \"Sully\" a hit but couldn't interest anyone in the widely ridiculed threequel \"Inferno.\" \nBut even quality, star-driven movies can be a tough sell. Meryl Streep pulled in just $27 million for \"Florence Foster Jenkins.\" Amy Adams and Jake Gyllenhaal haven't been able to propel \"Nocturnal Animals\" past the $10 million mark. Jury's still out on Denzel Washington 's \" Fences ,\" which has made just $33 million in three weeks but has yet to go into wide release. After tireless promotion by stars Ryan Gosling and Emma Stone , three-week-old \" La La Land \" is the biggest limited-release hit of the year, but even that amounts to only about $37 million so far. \n8. Movies for Guys Yes, testosterone still rules the marketplace, which helps explain all the superhero movies. Still, it's worth noting that at least eight of the top 25 movies are driven by female protagonists, as studios start to recognize that women buy tickets too. \nMeanwhile, sausage fests like \"The Nice Guys,\" \"War Dogs,\" \"Dirty Grandpa,\" and the current \"Assassin's Creed\" and \"Why Him?\" all had a hard time drawing dudes to the theater. \nMaybe guys stayed home this weekend to watch college football playoffs, or maybe there just wasn't anything on that menu as compelling as watching Felicity Jones fight the empire in \"Rogue One.\"", "external_links": [], "published": "2017-01-02T12:00:00.000+02:00", "crawled": "2017-01-02T08:35:04.359+02:00", "highlightTitle": ""}