{"organizations": [], "uuid": "b3d968eeba5eef756a27e66b26df13d7d331527c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 360, "shares": 360, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thenationonlineng.net", "main_image": "http://thenationonlineng.net/wp-content/uploads/2016/12/CUSTOMS-CG-ALI-NEW.jpg", "site_section": "http://thenationonlineng.net/feed", "section_title": "The Nation Nigeria", "url": "http://thenationonlineng.net/vehicles-trapped-borders-ban-imports-takes-off/", "country": "US", "domain_rank": 6634, "title": "Customs implements ban on vehicles import", "performance_score": 3, "site": "thenationonlineng.net", "participants_count": 1, "title_full": "Customs implements ban on vehicles import", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-04T06:06:00.000+02:00", "replies_count": 0, "uuid": "b3d968eeba5eef756a27e66b26df13d7d331527c"}, "author": "John Ofikhenua", "url": "http://thenationonlineng.net/vehicles-trapped-borders-ban-imports-takes-off/", "ord_in_thread": 0, "title": "Customs implements ban on vehicles import", "locations": [], "entities": {"persons": [{"name": "ahmed mohammed", "sentiment": "none"}, {"name": "augustine chidi", "sentiment": "none"}, {"name": "amiwero", "sentiment": "none"}, {"name": "abueh", "sentiment": "none"}, {"name": "taupyen", "sentiment": "none"}, {"name": "alhaji bisiriyu danu", "sentiment": "none"}, {"name": "lucky amiwero", "sentiment": "none"}, {"name": "charles edike", "sentiment": "none"}, {"name": "abdulkadir azerema", "sentiment": "none"}, {"name": "joseph attah", "sentiment": "none"}, {"name": "hameed ibrahim ali", "sentiment": "none"}, {"name": "aminu dangaladima", "sentiment": "none"}, {"name": "selechang taupyen", "sentiment": "none"}, {"name": "umar sanusi", "sentiment": "none"}, {"name": "danu", "sentiment": "none"}, {"name": "sam maduike", "sentiment": "none"}, {"name": "stanley ezenga", "sentiment": "none"}, {"name": "john ofikhenua", "sentiment": "none"}, {"name": "francis dosumu", "sentiment": "none"}, {"name": "wale adeniyi", "sentiment": "none"}], "locations": [{"name": "seme", "sentiment": "none"}, {"name": "lagos", "sentiment": "none"}, {"name": "anlca", "sentiment": "none"}, {"name": "abuja", "sentiment": "none"}, {"name": "badagry", "sentiment": "none"}], "organizations": [{"name": "home featured customs", "sentiment": "negative"}, {"name": "customs", "sentiment": "negative"}, {"name": "the nigeria customs service", "sentiment": "none"}, {"name": "association of nigerian licensed customs agents", "sentiment": "none"}, {"name": "ncs", "sentiment": "none"}, {"name": "lagos state", "sentiment": "none"}, {"name": "apapa customs area command", "sentiment": "none"}, {"name": "seme chapter", "sentiment": "none"}, {"name": "ftz", "sentiment": "none"}, {"name": "federal government", "sentiment": "none"}, {"name": "news agency of nigeria", "sentiment": "none"}, {"name": "national council of managing directors of licensed customs agents", "sentiment": "none"}, {"name": "nigeria customs service", "sentiment": "none"}, {"name": "seme command", "sentiment": "none"}, {"name": "national association of government approved freight forwarders", "sentiment": "none"}, {"name": "nan", "sentiment": "none"}, {"name": "nagaff", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Home Featured Customs implements ban on vehicles import Customs implements ban on vehicles import Posted By: John Ofikhenua on: January 04, 2017 \n•NCS: vehicles, rice imports prohibited through land boarders \nTHE Nigeria Customs Service (NCS) has started the implementation of the policy banning importation of vehicles through the land borders with many vehicles trapped at the borders. The Association of Nigerian Licensed Customs Agents (ANLCA), Seme Chapter, Lagos State confirmed yesterday that many vehicles were trapped at the border posts. A statement yesterday by the Customs Deputy Public Relations Officer, Mr. Joseph Attah, quoted the Comptroller-General Col. Hameed Ibrahim Ali (rtd), as reiterating the Federal Government ban on importation of rice and vehicles through the land borders. He urged officers and men of the service to ensure maximum collection of revenue and strict implementation of government’s fiscal policy. The Public Relations Officer of the NCS, Seme Command, Mr. Selechang Taupyen, told the News Agency of Nigeria (NAN) in Badagry that the service had to comply with government’s fiscal policy. Taupyen said the command’s officials had been placed at strategic places to curb any form of smuggling of cars. The Federal Government had on December 5 placed a ban on importation of used and new vehicles through land borders with effect from January 1, 2017. “The Federal Government has directed that importation of cars through the land borders should be banned and we are the agency that would enforce it. So, we have started with that. “The border is close to the point of importation of cars and the command has placed its men and escorts at strategic places to ensure that there is no smuggling of cars through the border. “We also have a good working relationship and synergy with other security agencies, who assist us in enforcing this policy because we all work for the same government. “We advise the public to abide by the government policy and if they must purchase a car, then it should come through the seaport as any vehicle that tries to come through the land border would be seized and confiscated. “Violators of the law would face the full wrath of the law,’’ he said. Taupyen added that the policy was meant to encourage local production of vehicles. “The public must look at the long term benefit of this policy as this would help in encouraging local production of vehicles and it would boost the economy,” he said. The Chairman of ANLCA, Alhaji Bisiriyu Danu, said as at Friday, December 30, 2016, the Customs authorities asked the agents to stop payment of Customs duty on vehicles by 5p.m. Danu said the association was not aware of any circular counter to the ban. He said so many vehicles uncleared by Customs agents were as at yesterday morning trapped at the ports of neighbouring countries. The Customs agent said the association went into dialogue with some government representatives to grant a three-month grace period. Danu said the grace period would enable ships carrying vehicles to berth for clearance before implementation of the ban. The Customs agent said the ban would render many car dealers around Badagry and environs idle and this could be a dangerous trend. A major stakeholder in Seme, Chief Sam Maduike, pleaded with the Federal Government to lift the ban. “The policy is going to bring untold hardship to the masses as the average Nigerians cannot afford to buy a brand new car,” he said. The President of the National Council of Managing Directors of Licensed Customs Agents, Mr. Lucky Amiwero, told NAN that the Federal Government should inaugurate a committee to look critically into the implications of the ban on vehicle imports. He said government should also look at the risk of the ban to the lives of Customs officers because there would be increase in smuggling. Amiwero said a question that should also be asked is: “Are Nigerian Ports friendly to accept vehicles?” He urged government to address the high cost of doing business in Nigerian ports. The National Association of Government Approved Freight Forwarders (NAGAFF) yesterday said it supported the ban. Its National Publicity Secretary, Mr. Stanley Ezenga, told NAN that the association’s support was borne out of the economic benefits that the policy would bring to the nation. \nCustoms re-deploys senior officers \nTHE Nigeria Customs Service (NCS) yesterday re-deployed eight Assistant Comptrollers-General and 238 Deputy Comptrollers-General of Customs. In a statement made available to reporters in Abuja, its Deputy Public Relations Officer, Mr. Joseph Attah, noted that the action was designed to strengthen operations and reposition the service to meet the challenges of the new year. The statement said: “In a bid to strengthen operations and reposition the service to meet the challenges of the new year, the Comptroller-General of Customs, Col. Hameed Ibrahim Ali (rtd), has approved the redeployment of eight Assistant Comptrollers-General and 238 Deputy Comptrollers of Customs.” With the redeployment, which takes immediate effect, the following Assistant Comptrollers-General: ACG Charles Edike has been moved from Zone A to Human Resource Development (HRD), ACG Ahmed Mohammed deployed from HRD to Zone B, ACG Aminu Dangaladima moved from Zone B to Enforcement. Also, ACG Francis Dosumu was been deployed from Enforcement to Zone D, ACG Augustine Chidi moved from Zone D to Excise, Free Trade Zone and Industrial Incentives (Ex,FTZ, & I I), ACG Monday Abueh moved from Ex ,FTZ, & I I to Zone A, ACG Umar Sanusi from HQ to Zone C, ACG Abdulkadir Azerema from Zone C to HQ.” The statement added that the redeployment of Deputy Comptrollers of Customs affected the Service Public Relations Officer, DC Wale Adeniyi, who is now posted to Apapa Customs Area Command, Lagos.", "external_links": [], "published": "2017-01-04T06:06:00.000+02:00", "crawled": "2017-01-04T04:51:39.542+02:00", "highlightTitle": ""}