{"organizations": [], "uuid": "ffdcc58d1dcdbf929eafe9c115e1e45c3cc02286", "thread": {"social": {"gplus": {"shares": 4}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 9}, "facebook": {"likes": 183, "shares": 183, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessinsider.com", "main_image": "http://static2.businessinsider.com/image/586c1afaf10a9a6d008b65a2-1190-625/17-innovative-features-in-fiat-chryslers-new-electric-minivan-concept.jpg", "site_section": "http://www.businessinsider.com/sai/contributor.rss", "section_title": "Business Insider", "url": "http://www.businessinsider.com/fiat-chrysler-minivan-concept-car-ces-2017-photos-features-2017-1", "country": "US", "domain_rank": 283, "title": "17 innovative features in Fiat Chrysler's new electric minivan concept", "performance_score": 1, "site": "businessinsider.com", "participants_count": 1, "title_full": "17 innovative features in Fiat Chrysler's new electric minivan concept", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-04T06:19:00.000+02:00", "replies_count": 0, "uuid": "ffdcc58d1dcdbf929eafe9c115e1e45c3cc02286"}, "author": "Danielle Muoio", "url": "http://www.businessinsider.com/fiat-chrysler-minivan-concept-car-ces-2017-photos-features-2017-1", "ord_in_thread": 0, "title": "17 innovative features in Fiat Chrysler's new electric minivan concept", "locations": [], "entities": {"persons": [{"name": "dunford", "sentiment": "none"}, {"name": "emilio feliciano", "sentiment": "none"}, {"name": "ashley edgar", "sentiment": "none"}, {"name": "matt dunford", "sentiment": "none"}], "locations": [{"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "fiat chrysler", "sentiment": "negative"}, {"name": "panasonic", "sentiment": "none"}, {"name": "audi", "sentiment": "none"}, {"name": "fca", "sentiment": "none"}, {"name": "samsung", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "print \nCadie Thompson/Business Insider Fiat Chrysler unveiled a new minivan concept designed specifically for millennials at the Consumer Electronics Show on Tuesday.\nThe vehicle, shown at FCA's very first CES press conference, is meant to appeal to tech-savvy millennials looking to start a family. \nScroll down for a detailed breakdown of the brand new minivan concept, called the Portal: View As: One Page Slides The Portal is geared toward millennials looking to \"hang up the hoverboard and have babies,\" FCA engineer Ashley Edgar said at the CES event. It has two rows of seats in the back and has seating for up to six passengers. Screenshot FCA said it studied millennials for \"more than 20 years, using ethnographic research\" and said it was important for the minivan to feature upgradeable tech and autonomous capabilities to appeal to that generation. The minivan also had to be affordable and environmentally responsible as part of that effort. Screenshot A 100 kWh battery pack sits at the bottom of the car and offers a range of more than 250 miles on a single charge, FCA said. Screenshot With a DC Fast Charger, FCA said the electric minivan concept can charge up to 150 miles in just 20 minutes. Screenshot The car comes with self-driving technology like lidar and sensors that provide Level 3 autonomous capabilities. That means the car can handle situations like accelerating and braking on its own, but it still requires human intervention and oversight. Screenshot Matt Dunford, the FCA exterior designer on the project, said that while most automakers aim to hide car doors, it purposefully made the doors a focal point. FCA shifted the car's B Pillar so the doors slide open. FCA An LED light strip encircling the doors changes colors. The driver can opt to have it stay a certain color to make it easier for friends to find the car. \nThe headlamps and tail lights offer adaptive LED lighting to improve visibility while driving. Screenshot The vehicle also comes with a transparent canopy that is broken up by carbon fiber pillars to provide \"specific pools of light\" to each passenger. Screenshot The sideview mirrors have also been replaced with cameras to provide 360 degrees of visibility. Screenshot Inside the car, the minivan concept comes with seats mounted on a floor track so that they can be easily moved to offer more cargo space. The seats can also fold up and be removed altogether. There are also charging stations in the seats. Screenshot The car comes with two Samsung OLED display screens. The top one comes with facial recognition and voice control capabilities, which allows the car to recognize the driver and customize the interior, like lighting and music, to the driver's preferences. Screenshot That main display on top of the center console features interactive graphics so you can see things like a car passing in your blind spot or your speed as it changes. \nBut there's also an overhead display for passengers in the second and third rows that can be used for e-commerce, like sending alerts about the nearest In-N-Out Burger, FCA designer Emilio Feliciano said at the CES event. It can also stream movies and video games. Screenshot FCA also says the vehicle comes with Personal Zoned Audio by Panasonic so you don't need to wear headphones in the car. That way, a passenger in the back could watch a show without the driver hearing it. FCA The concept also comes with an in-vehicle network that allows passengers to share photos, images, and videos while in the car. FCA It also accommodates Vehicle-to-X communication, meaning it could talk to infrastructures like traffic lights as well as other cars on the road to send information. Screenshot \nThe government recently proposed that new cars and light trucks be able to talk to other vehicles on the road. Audi also recently installed the first communication system that allows cars to talk to traffic lights (in Las Vegas) so the driver knows when the light will turn green. \nThese communication systems provide data like upcoming traffic congestion so drivers can react accordingly, but they could also assist self-driving cars that rely on the data to make decisions. \nOverall, the minivan concept is meant as \"a space where millennials will feel at home and inspired,\" FCA's Dunford said at the event. There's no word yet on whether a production version of the vehicle will be made available.", "external_links": [], "published": "2017-01-04T06:19:00.000+02:00", "crawled": "2017-01-04T01:29:59.603+02:00", "highlightTitle": ""}