{"organizations": [], "uuid": "b2f58378ab686c8bc7d6a9f687eef1b5d485a4ac", "thread": {"social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 150, "shares": 150, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vanguardngr.com", "main_image": "http://d19lga30codh7.cloudfront.net/wp-content/uploads/2016/12/happy-new-year.png", "site_section": "http://www.vanguardngr.com/feed", "section_title": "Vanguard News", "url": "http://www.vanguardngr.com/2017/01/rolling-2017-nigeria-stylee/", "country": "US", "domain_rank": 2203, "title": "Rolling into 2017 Nigeria ‘stylee’", "performance_score": 1, "site": "vanguardngr.com", "participants_count": 1, "title_full": "Rolling into 2017 Nigeria ‘stylee’", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-02T06:20:00.000+02:00", "replies_count": 0, "uuid": "b2f58378ab686c8bc7d6a9f687eef1b5d485a4ac"}, "author": "adekunle", "url": "http://www.vanguardngr.com/2017/01/rolling-2017-nigeria-stylee/", "ord_in_thread": 0, "title": "Rolling into 2017 Nigeria ‘stylee’", "locations": [], "entities": {"persons": [{"name": "ifeanyi arthur okowa", "sentiment": "none"}, {"name": "bode george", "sentiment": "none"}, {"name": "alkhali mohammed", "sentiment": "none"}, {"name": "ali ndume", "sentiment": "none"}, {"name": "owei lakemfa", "sentiment": "none"}, {"name": "james onanefe ibori", "sentiment": "none"}, {"name": "madam", "sentiment": "none"}, {"name": "abdulaziz abubakar yari", "sentiment": "none"}, {"name": "rochas anayo okorocha", "sentiment": "none"}, {"name": "nkechi okorocha", "sentiment": "none"}], "locations": [{"name": "nigeria", "sentiment": "none"}, {"name": "lagos", "sentiment": "none"}, {"name": "kenya", "sentiment": "none"}, {"name": "abuja", "sentiment": "none"}, {"name": "owei lakemfa", "sentiment": "none"}, {"name": "zamfara", "sentiment": "none"}, {"name": "okorocha", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "anpp", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "rivers state", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "national assembly", "sentiment": "none"}, {"name": "independent national electoral commission", "sentiment": "none"}, {"name": "state secretariat", "sentiment": "none"}, {"name": "all progressives grand alliance", "sentiment": "none"}, {"name": "pdp", "sentiment": "none"}, {"name": "all nigeria peoples party", "sentiment": "none"}, {"name": "health", "sentiment": "none"}, {"name": "delta state", "sentiment": "none"}, {"name": "apga", "sentiment": "none"}, {"name": "women affairs", "sentiment": "none"}, {"name": "state amnesty committee", "sentiment": "none"}, {"name": "okorocha school of governance and political engineering", "sentiment": "none"}, {"name": "amnesty", "sentiment": "none"}, {"name": "civil service", "sentiment": "none"}, {"name": "action alliance", "sentiment": "none"}, {"name": "imo state", "sentiment": "none"}, {"name": "democratic party", "sentiment": "none"}, {"name": "apc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Home » Columns » Owei Lakemfa » Rolling into 2017 Nigeria ‘stylee’ Rolling into 2017 Nigeria ‘stylee’ On 12:20 am In Owei Lakemfa by adekunle Comments \nBy Owei Lakemfa I HAVE spent years studying governance in Nigeria and reached the conclusion that even if I spend the next century, I will remain unschooled. I have many teachers, but my favourite is 54-year old Rochas Anayo Okorocha the charismatic Governor of Imo State. He started out early in life as a trader and the survivalist instinct has seen him navigate through many waters. \nNigeria returned to civil administration seventeen years ago; in that period Okorocha has belonged or changed party seven times. He joined or rejoined a political party on the average, every thirty months. He set out with the Peoples’ Democratic Party, PDP, moved to the All Nigeria Peoples Party, ANPP, returned to the PDP, then joined the Action Alliance, AA, before navigating his way back to the PDP, then set sail on the All Progressives Grand Alliance, APGA, ship, before joining the All Progressives Congress, APC, where he is the Chair of their Governors Forum. \nRochas so loves his people that he never stops crowing “My people! My people!! My people!!!” To demonstrate his love for the people, he made his wife, Mrs. Nkechi Okorocha, administrator of four Ministries including the Office of the Secretary to the State Government to which technically, all other Ministries report. The Ministries under her portfolio include Health, Women Affairs and Works. Rochas conscious that Madam is quite hard working, also made her the Chairman of the State Amnesty Committee. \nAware that the state workers are not hardworking, he gives them ample time to rest. He reduced the five-day work week to three; Monday to Wednesday, asking them to spend the next two days farming, that is assuming they have farms. For Christmas and New Year, he awarded the state workers, three weeks public holidays. \nWhat I have learnt on governance from Okorocha is; rather than state clearly that the work force is indolent and unnecessary, he awards them weekly holidays so they don’t clog the roads in the name of going to work or occupy the State Secretariat or public offices for too long. In truth, if Her Excellency alone can run four Ministries, the Office of the First Lady and two public projects; the Amnesty and Needs a Roof Project, SNARP,? \nthen the state does not need more than three persons in the cabinet. If I were to summarise the lessons I have learnt from the Okorocha School of Governance and Political Engineering, I will say, it is about smart governance. That all a state needs is a governor, a dynamic person that can combine the Ministries, and the Commissioner of Finance who can travel monthly to Abuja, collect the monthly allocation of the state and deliver same to the cabinet. A state neither needs a spare tyre – which is how a Deputy Governor is regarded – nor the Civil Service. \nI had argued blindly that the first priority of states is to pay workers’ salary especially when in almost all the states, the public service is the mainstay of the economy. I had posited that paying workers salary is the sure way of awakening state economies as the money will circulate locally with farmers, traders, transporters, landlords, market people and service providers having cuts. But I have since read the informed position of leading economists and policy soothsayers who explain that paying salaries is mere expenditure when the priority should be, investing in the “productive sectors of the economy”. ? So when I read that a state like Zamfara is owing thirty two months salary, I knew that Governor Abdulaziz Abubakar Yari, the Shatiman Mafara, must have been schooled by one of those experts. \nI hear that work without pay is charity; I am sure workers will feed their families and pay their bills with charity. Those who say a labourer deserves his wages, should seek a vocation in the monastery or the mosque; these are not times of morality. In any case, what is a worker who has not been paid for two years, doing at his duty post? Where does he get money to subsidise his work including paying transportation? \nLet me at this point commend the National Assembly for remaining civil; even when Distinguished Senators like Ali Ndume, openly contradict the Distinguished Senators, clarifications are made, and the position of the hallowed chambers reiterated without any acrimony. Only once in this Eighth Assembly, have our legislators come to blows. Compare this with their colleagues in Kenya who learn boxing, wrestling and taekwondo on the floor of the Parliament. \nHaving missed out of the Nobel Prize, I am sure we will in 2017 have an enviable place in the Guinness Book of Records for conducting the longest elections in world history. National and state legislative elections were conducted in Rivers State in 2015, some of them annulled by the courts that year. The rerun elections on March 19 was rendered inconclusive by bloody battles. Violence ensured the postponement of the July 30 rerun and even when the last rerun took place on International Human Rights Day, December 10, violence still rendered some of the elections inconclusive. The last bloody rerun included the beheading of Deputy Superintendent of Police, Alkhali Mohammed and his orderly. \nThe Police is carrying out a probe of the December 10 rerun violence; the State Government which has pledged not to cooperate with the Police, is carrying out its own judicial probe while the Independent National Electoral Commission is carrying out its own version of a probe. The only group that has not set up its own probe panel, is the electorate. \nThe year 2016 ended on a very happy note for Delta State, my beloved home state. Our former governor, James Onanefe Ibori was freed from a London jail on Wednesday December 21 after serving time following his April 17, 2012 conviction for stealing $250 million (N121,750,000,000 by current market rate) from our state coffers. \nOur dynamic government under the able leadership of Senator Ifeanyi Arthur Okowa told the world on behalf of Deltans “We are all very happy that our son, our brother, former governor has been released. So, it is a thing of joy and the only expression as a state is that we are happy.” \nI am happy to witness such an historic moment when the release of a convict is received with such celebration. The last time I witnessed this was when leading politician, Bode George was released from prison in Lagos after serving time for contract splitting. Given such tearful historic scenes, I suggest that we start sewing academic gowns, organising graduation ceremonies for convicts leaving prison and streaming them live on television and the internet. \nThis is the way we rolled into 2017. Wishing you all, Happy New Year!", "external_links": [], "published": "2017-01-02T06:20:00.000+02:00", "crawled": "2017-01-02T01:31:49.875+02:00", "highlightTitle": ""}