{"organizations": [], "uuid": "30c0e6be95ac1024ae864fd756350a0db2527e3a", "thread": {"social": {"gplus": {"shares": 18}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 60}, "facebook": {"likes": 253, "shares": 253, "comments": 1}, "stumbledupon": {"shares": 0}}, "site_full": "techcrunch.com", "main_image": "https://tctechcrunch2011.files.wordpress.com/2016/01/img_0703.jpg?w=764&amp;h=400&amp;crop=1", "site_section": "http://feeds.feedburner.com/Techcrunch", "section_title": "TechCrunch", "url": "https://techcrunch.com/2017/01/03/lego-boost/", "country": "US", "domain_rank": 697, "title": "Lego targets pre-Mindstorms minds with its Boost educational kit", "performance_score": 2, "site": "techcrunch.com", "participants_count": 1, "title_full": "Lego targets pre-Mindstorms minds with its Boost educational kit", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-04T12:01:00.000+02:00", "replies_count": 0, "uuid": "30c0e6be95ac1024ae864fd756350a0db2527e3a"}, "author": "Brian Heater", "url": "https://techcrunch.com/2017/01/03/lego-boost/", "ord_in_thread": 0, "title": "Lego targets pre-Mindstorms minds with its Boost educational kit", "locations": [], "entities": {"persons": [{"name": "johnny", "sentiment": "none"}, {"name": "rube", "sentiment": "none"}, {"name": "vernie", "sentiment": "none"}, {"name": "lego", "sentiment": "none"}], "locations": [], "organizations": [{"name": "ford", "sentiment": "negative"}, {"name": "toyota", "sentiment": "negative"}, {"name": "mindstorm", "sentiment": "none"}, {"name": "move hub", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Lego targets pre-Mindstorms minds with its Boost educational kit Posted Ford and Toyota launch consortium to help developers build in-car apps \nBoost is an impressive kit. The five on-board building experiences cover a lot of ground, from a robot to a guitar, to quasi Lego “3D printer” that’s more like an assembly line Rube Goldberg-style device that pieces together its own Lego creations. \nThe set is being couched as an educational kit, joining Lego’s line in a difficulty level a step down from the company’s much loved Mindstorm line. As with many other recent educational toys, the product has some very basic element of coding baked into the connected Android/iOS app. While the company is hesitant to make claims that it will actually teach kids how to code, it’s an attempt to lay some of that early groundwork. \nThe kit is designed for kids aged seven and up and is built around a Move Hub, which utilizes a variety of sensors like tilt, color and distance that help the different designs perform a variety of automated tasks laid out on the app through a series of actionable items on a timeline. \nThe first creation designed to be built out of the box is Vernie, a sort of Johnny 5/Wall-esque robot programmed to project a personality – which is what Johnny 5/Wall-esque robots do best – in order to develop a personal connection with the kids, before the inevitable time comes to tear him down and build something new. He has articulating facial features and will repeat your name back to you. \nThe set consists of 543 piece, which are – as with all of Lego’s offerings – compatible with different kits. The set will arrive in the second half of the year, priced at $160 and is the first of what Lego expects to be a larger line of educational sets for kids who aren’t quite ready to make the jump to Mindstorms. Latest from CES 2017 More CES 2017", "external_links": [], "published": "2017-01-04T12:01:00.000+02:00", "crawled": "2017-01-04T07:05:54.390+02:00", "highlightTitle": ""}