{"organizations": [], "uuid": "6489eaf95f6ae16c85ea36300ce83d663149b0f1", "thread": {"social": {"gplus": {"shares": 29}, "pinterest": {"shares": 2}, "vk": {"shares": 0}, "linkedin": {"shares": 118}, "facebook": {"likes": 152, "shares": 152, "comments": 1}, "stumbledupon": {"shares": 0}}, "site_full": "techcrunch.com", "main_image": "https://tctechcrunch2011.files.wordpress.com/2016/06/p6160335.jpg?w=764&amp;h=400&amp;crop=1", "site_section": "http://feedproxy.google.com/TechCrunch", "section_title": "TechCrunch", "url": "https://techcrunch.com/2017/01/04/works-with-fitbit/", "country": "US", "domain_rank": 697, "title": "Fitbit announces integration with a nutrition service and a virtual reality bike", "performance_score": 1, "site": "techcrunch.com", "participants_count": 1, "title_full": "Fitbit announces integration with a nutrition service and a virtual reality bike", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-04T21:00:00.000+02:00", "replies_count": 0, "uuid": "6489eaf95f6ae16c85ea36300ce83d663149b0f1"}, "author": "Brian Heater", "url": "https://techcrunch.com/2017/01/04/works-with-fitbit/", "ord_in_thread": 0, "title": "Fitbit announces integration with a nutrition service and a virtual reality bike", "locations": [], "entities": {"persons": [{"name": "fitbit", "sentiment": "none"}], "locations": [{"name": "peleton", "sentiment": "none"}, {"name": "fitbit", "sentiment": "none"}], "organizations": [{"name": "pegasus", "sentiment": "none"}, {"name": "nba", "sentiment": "none"}, {"name": "magic leap", "sentiment": "none"}, {"name": "amazon echo", "sentiment": "none"}, {"name": "ces", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Fitbit announces integration with a nutrition service and a virtual reality bike Posted What can we learn from Magic Leap’s latest PR trip? \nFitbit’s already got some of the top-selling fitness trackers on the market, but as the space faces a potential over-saturation, continued success lies in partnerships. As such, the wearable maker’s been building up its Works With Fitbit ecosystem one piece at a time. \nIn the past year, Fitbit has added a couple of key partners, including a skill for Amazon Echo and an NBA 2K17 partnership that offers in-game bonuses for those who hit their goals. This year at CES, the company is rolling out a trio of additions, including a nutrition site and two fairly unique takes on the stationary bike. \nHabit is probably the most straight forward of the three. The deal will utilize data gathered from Fitbit devices to create food recommendations and nutritional plans through the personalized nutrition service. The service utilizes metrics like wight, body fat percentage and calories burned to create specially tailored meal plans. \nFor example, if your goal is to lose 10 pounds, but your daily activity isn’t sufficient to meet this goal, Habit could adjust (decrease) your daily calorie recommendation and modify the amounts and types of carbs, fat and protein you should eat to help you meet your goal. \nPeleton, a stationary bike company that offers live streaming classes, will feature Fitbit integration, letting users track their progress on the bike with their wearable, including a full post-workout break down. \nDitto for VirZOOM , the indoor VR bike that we tried out at E3 last year, so users can track all of the time they’ve spent peddling around as a Pegasus or tank. Data collected includes distance pedaled (or, one assumes, miles flown in the case of the flying horse), workout time and calories burned. \nThe partnerships will be on display this week at CES. 0", "external_links": [], "published": "2017-01-04T21:00:00.000+02:00", "crawled": "2017-01-04T16:23:57.880+02:00", "highlightTitle": ""}