{"organizations": [], "uuid": "ffc715ebf564aa01d1621abf9c4c4c901fd99177", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 214, "shares": 214, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "comicbook.com", "main_image": "http://media.comicbook.com/2017/01/izombie-news-222748-640x320.jpg", "site_section": "http://www.comicbook.com//rss", "section_title": "Comicbook.com", "url": "http://comicbook.com/2017/01/04/izombies-rahul-kohli-is-moving-and-shaving-so-dont-freak-out/", "country": "US", "domain_rank": 2930, "title": "iZombie's Rahul Kohli is Moving and Shaving, So Don't Freak Out", "performance_score": 2, "site": "comicbook.com", "participants_count": 1, "title_full": "iZombie's Rahul Kohli is Moving and Shaving, So Don't Freak Out", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-04T09:56:00.000+02:00", "replies_count": 0, "uuid": "ffc715ebf564aa01d1621abf9c4c4c901fd99177"}, "author": "Russ Burlingame", "url": "http://comicbook.com/2017/01/04/izombies-rahul-kohli-is-moving-and-shaving-so-dont-freak-out/", "ord_in_thread": 0, "title": "iZombie's Rahul Kohli is Moving and Shaving, So Don't Freak Out", "locations": [], "entities": {"persons": [{"name": "rahul kohli", "sentiment": "negative"}, {"name": "michael allred", "sentiment": "none"}, {"name": "chris roberson", "sentiment": "none"}, {"name": "thomas", "sentiment": "none"}, {"name": "— rahul kohli", "sentiment": "none"}, {"name": "rob thomas", "sentiment": "none"}, {"name": "kohli", "sentiment": "none"}], "locations": [{"name": "vancouver", "sentiment": "none"}], "organizations": [{"name": "cw", "sentiment": "none"}, {"name": "cw /warner bros", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "iZombie's Rahul Kohli is Moving and Shaving, So Don't Freak Out Russ Burlingame Tweet This \niZombie standout Rahul Kohli wants fans to know that he's going to shave. \nWell, more accurately, Rahul Kohli is going to shave, but a recent experience tells him he should probably warn people first. (Photo: The CW /Warner Bros. TV ) \nAs iZombie wraps its third season soon, Kohli has apparently decided to move apartments, leaving the one he's been living in since the series began. \nA tweet about his bittersweet goodbye to the apartment and its view of the Vancouver skyline, thanking the city for three great years, apparently set off Twitter fans, who took it to mean that iZombie was coming to an end and he was moving as a result. \nThis is, Kohli had to add, not the case. \nShortly after, he posted a follow-up tweet that explained his apartment change, adding that there was no word yet on a season 4 for the cult-hit series. \n(That's not all that surprising, since season 3 hasn't yet debuted.) \nNot long after the follow-up explanation, Kohli shared with his audience that \"ALERT! I will be shaving my beard off soon, this in no way reflects my character's fate nor does it mean there is no [season 4]. It means I shaved.\" \nYou can see the trio of tweets below. \nI'm gonna miss this view every morning. A big thank you to the city and people of Vancouver for making these last 3 years so special. pic.twitter.com/waoPAzjoIm — Rahul Kohli (@RahulKohli13) January 2, 2017 \n(Fuck me, let me clarify. Leaving this apartment for good, pretty much wrapped for 3, no word on 4 but fingers crossed) — Rahul Kohli (@RahulKohli13) January 2, 2017 \nALERT! I will be shaving my beard off soon, this in no way reflects my character's fate nor does it mean there is no se4. It means I shaved. — Rahul Kohli (@RahulKohli13) January 2, 2017 \nThis is, perhaps, not a surprising evolution of the fan-celebrity relationship: casting news, appearance changes, and other seemingly-innocuous everyday events and changes are often pointed to as conclusive evidence of show-changing events on The Walking Dead , for instance. \nShowrunner Rob Thomas has been developing other shows, notably The Lost Boys for The CW. Back in November, a rumor started that season 3 would be the show's final outing, but Thomas took to Twitter back then to dismiss those rumors as well. \niZombie 's season 3 will premiere in April. It's based on the Vertigo comic book created by Michael Allred and Chris Roberson.", "external_links": [], "published": "2017-01-04T09:56:00.000+02:00", "crawled": "2017-01-04T05:18:29.965+02:00", "highlightTitle": ""}