{"organizations": [], "uuid": "4f98cbf564b775ca5370d120bce9469d5963d162", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 997, "shares": 997, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "minnesota.cbslocal.com", "main_image": "https://cbsminnesota.files.wordpress.com/2016/12/triclosan.jpg?w=1280", "site_section": "http://minnesota.cbslocal.com/comments/feed/", "section_title": "WCCO | CBS Minnesota", "url": "http://minnesota.cbslocal.com/2016/12/31/triclosan-ban-2/", "country": "US", "domain_rank": 1192, "title": "Minnesota Becomes 1st State To Ban Potentially Harmful Germ Killer", "performance_score": 9, "site": "cbslocal.com", "participants_count": 1, "title_full": "Minnesota Becomes 1st State To Ban Potentially Harmful Germ Killer", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-01T11:13:00.000+02:00", "replies_count": 0, "uuid": "4f98cbf564b775ca5370d120bce9469d5963d162"}, "author": "WCCO | CBS Minnesota", "url": "http://minnesota.cbslocal.com/2016/12/31/triclosan-ban-2/", "ord_in_thread": 0, "title": "Minnesota Becomes 1st State To Ban Potentially Harmful Germ Killer", "locations": [], "entities": {"persons": [{"name": "nin", "sentiment": "negative"}, {"name": "bill arnold", "sentiment": "none"}, {"name": "nina moini", "sentiment": "none"}, {"name": "nina", "sentiment": "none"}, {"name": "arnold", "sentiment": "none"}], "locations": [{"name": "minnesota", "sentiment": "none"}, {"name": "minneapolis", "sentiment": "none"}, {"name": "apple valley", "sentiment": "none"}, {"name": "denmark", "sentiment": "none"}], "organizations": [{"name": "arnold", "sentiment": "none"}, {"name": "university of minnesota", "sentiment": "none"}, {"name": "wcco", "sentiment": "none"}, {"name": "wcco-tv", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Minnesota Becomes 1st State To Ban Potentially Harmful Germ Killer December 31, 2016 10:13 PM By Nina Moini Filed Under: Nina Moini \nMINNEAPOLIS (WCCO) — A state law going into effect Jan. 1 2017 will change the way Minnesotans buy soap. \nMinnesota is the first state to ban the germ-killing chemical triclosan once commonly found in anti-bacterial soaps. \nStudies found it was not any more effective than regular soap and could have adverse impacts on the environment and peoples’ health. \nIt is a problem University of Minnesota professor Bill Arnold has spent years studying. \nHe said some chemicals in the sink go down the drain and eventually end up in area lakes and rivers. \n“There’s the potential for it to affect the ecosystem as well,” Arnold said. “We looked at seven different lakes in Minnesota a couple years back and found that triclosan was accumulating in all of them in the lake sediments.” \nArnold said the chemical triclosan enabled companies to market products as anti-bacterial, and it was once widely used in soaps, deodorants and toothpaste. \nStudies began showing it could disrupt the body’s hormones and other functions. \n“Anything that said ‘anti-bacterial’ on it that’s a liquid hand soap would have triclosan in it, or dishwashing liquids that were anti-bacterial were another big source of triclosan as well,” Arnold said. \nArnold’s research found it can be potentially harmful in lakes and rivers. \nThe findings led the state of Minnesota to ban the chemical in 2014, giving the industry until 2017 to comply. \n“Soap itself kills germs,” Arnold said. \nThe federal government followed that lead, banning 19 ingredients found in soaps and body washes because they could do more harm than good. \nCompanies have until September to take the products off shelves or remove the chemicals. \n“The hope is over time what’s there would slowly break down,” Arnold said of the impacts in area lakes. “Some of the reaction products that form actually might be of greater concern than triclosan itself, so stopping that input into the environment is important.” \nMost major companies have already phased out the chemical. \nHand sanitizers do not contain triclosan. Nina Moini facebook Follow Nina Moini joined the WCCO-TV team in August of 2013. She reports on a wide range of topics during weekdays and weekend nights. Nina grew up right here in Apple Valley (GO Eastview Lightning!), but was born in Denmark to Iranian parents who moved to...", "external_links": [], "published": "2017-01-01T11:13:00.000+02:00", "crawled": "2017-01-02T00:49:08.472+02:00", "highlightTitle": ""}