{"organizations": [], "uuid": "5412bbb5e05ed31a82abcef8d8fe0df2faa06146", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 192, "shares": 192, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mirror.co.uk", "main_image": "http://i3.mirror.co.uk/incoming/article9559791.ece/ALTERNATES/s1200/Celebrity-Big-Brother-TV-show-Elstree-Studios-Hertfordshire-UK-03-Jan-2017.jpg", "site_section": "http://www.mirror.co.uk/all-about/rss.xml", "section_title": "mirror - Home", "url": "http://www.mirror.co.uk/tv/tv-news/celebrity-big-brother-returns-2017-9559869", "country": "GB", "domain_rank": 804, "title": "Celebrity Big Brother returns for 2017 and Calum Best's bewildered face sums up a lukewarm launch night", "performance_score": 1, "site": "mirror.co.uk", "participants_count": 1, "title_full": "Celebrity Big Brother returns for 2017 and Calum Best's bewildered face sums up a lukewarm launch night", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-04T09:00:00.000+02:00", "replies_count": 0, "uuid": "5412bbb5e05ed31a82abcef8d8fe0df2faa06146"}, "author": "Danny Walker", "url": "http://www.mirror.co.uk/tv/tv-news/celebrity-big-brother-returns-2017-9559869", "ord_in_thread": 0, "title": "Celebrity Big Brother returns for 2017 and Calum Best's bewildered face sums up a lukewarm launch night", "locations": [], "entities": {"persons": [{"name": "calum best", "sentiment": "negative"}, {"name": "hedi", "sentiment": "none"}, {"name": "ray j", "sentiment": "none"}, {"name": "bianca gascoigne", "sentiment": "none"}, {"name": "james jordan", "sentiment": "none"}, {"name": "heidi", "sentiment": "none"}, {"name": "spencer", "sentiment": "none"}, {"name": "jamie o'hara", "sentiment": "none"}, {"name": "heidi montag", "sentiment": "none"}, {"name": "paul gascoigne", "sentiment": "none"}, {"name": "nicola mclean", "sentiment": "none"}, {"name": "jasmine waltz", "sentiment": "none"}, {"name": "stacy", "sentiment": "none"}, {"name": "ray", "sentiment": "none"}, {"name": "montag", "sentiment": "none"}, {"name": "james", "sentiment": "none"}, {"name": "kim kardashian west", "sentiment": "none"}, {"name": "emma", "sentiment": "none"}, {"name": "lia toby/wenn", "sentiment": "none"}, {"name": "kim k", "sentiment": "none"}, {"name": "stacy francis", "sentiment": "none"}, {"name": "calum", "sentiment": "none"}, {"name": "austin armacost", "sentiment": "none"}, {"name": "pratt", "sentiment": "none"}, {"name": "emma willis", "sentiment": "none"}, {"name": "angie best", "sentiment": "none"}, {"name": "kim kardashian", "sentiment": "none"}, {"name": "rylan", "sentiment": "none"}, {"name": "coleen nolan", "sentiment": "none"}, {"name": "dj brandon block", "sentiment": "none"}, {"name": "jasmine", "sentiment": "none"}, {"name": "spencer pratt", "sentiment": "none"}, {"name": "coleen", "sentiment": "none"}], "locations": [{"name": "spencer", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "austin", "sentiment": "none"}], "organizations": [{"name": "all stars", "sentiment": "none"}, {"name": "rex features", "sentiment": "none"}, {"name": "cbb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "TV Celebrity Big Brother returns for 2017 and Calum Best's bewildered face sums up a lukewarm launch night When Calum saw his mother, Angie Best, walk down the famous stairs and meet the housemates his look reflected the mood of the house Share Click to play Tap to play The video will start in 8 Cancel Play now Watch this year's contestants enter the CBB 2017 House Share this video Get celebs   Thank you for subscribing!   \nCelebrity Big Brother has returned for 2017 and Calum Best's bewildered face summed up a lukewarm launch night. \nThe beloved Channel 5 show is back on the box and we've been itching to meet the New Stars and get reacquainted with some infamous All Stars. \nDespite US star Stacy Francis (nope, us neither) getting EDITED OUT by her fellow housemates, nothing really happened. \nHowever, the moment reality TV lothario Calum saw that he was being joined in the house with his mum, Angie Best, will be a highlight for many. \nThis was actually worth tuning in for alone. What is this new look Calum? Oh yeah, shock! (Photo: Rex Features) That's it, hug mummy (Photo: Rex Features) Well done (Photo: Rex Features) Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Nicola McLean suffers awkward wardrobe malfunction entering the Celebrity Big Brother house \nThe night started with host Emma Willis teasing fans of the new line-up. \nThe CBB presenter - who gave birth to her third child Trixie in May 2016 - wore a gold sequinned jacket over a white shirt with black pussy bow. \nShe paired it with high-waisted flares - a move away from her usual choice of short skirt. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now CBB 2017: Emma Willis looks like a matador! Share this video Watch Next (Photo: Lia Toby/WENN) \nEmma was soon showing off her new hairstyle - having gone for a much shorter look, which many viewers loved - and the new Diary Room. \nBoth look like they'll be a visual highlight of the series. (Photo: Channel 5) Read More 'Why is Emma Willis dressed like a matador?' Celebrity Big Brother presenter's outfit blasted on launch night \nThe Channel 5 reality show seems to be the most colourful series yet as bosses combine old and new themes. \nThe bold and bright interior design, which has been inspired by pop art, has given the house its biggest transformation yet. \nThere almost headache-inducing pop of colour is bound to keep the housemates entertained throughout their drama-filled stay. \nThe first housemates to fill the house were pantomime villians, Heidi Montag and Spencer Pratt. \nSpeidi are officially back in the house and ready to cause mayhem. Heidi Montag and Spencer Pratt are back! (Photo: Lia Toby/WENN) \nHeidi and Spencer were the housemates everyone loved to hate in 2013 after they spectacularly fell out with Rylan. \nThe former Hills stars said they are returning because they want another shot at winning. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now CBB 2017: Hedi and Spencer are first celebs in the house Share this video Watch Next \nAnd the pair do not seem to have changed their ways - asked to describe themselves in three words, they said: \"Playa, playa, playa.\" \nWinning aside, Montag, 30, and Pratt, 33, said they are on a mission to \"make Speidi famous again\". Read More \nThey were soon joined by former Strictly Come Dancing professional James Jordan, Coleen Nolan, Calum Best, model Jasmine Waltz and reality star Austin Armacost make up the All Stars. (Photo: Channel 5) \nThe New Stars are made up of former US X Factor star Stacy Francis, Kim Kardashian West's ex-boyfriend and singer Ray J, and model and television personality Bianca Gascoigne, who is the stepdaughter of footballer Paul Gascoigne. \nThey are joined by DJ Brandon Block and model Nicola McLean who entered the house before Jamie O'Hara, Calum Best's mother Angie Best. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Kim Kardashian's ex-lover Ray J enters the CBB House 2017 Share this video Watch Next \nRay J is famous for starring in a sex tape with the Keeping Up With the Kardashians star. \nAnd he was NOT afraid to mention it in his VT more than once. \nHe's reportedly getting a record-breaking salary of $1million (£810,000) for his time in the house too. (Photo: WireImage) Read More Who will enter Celebrity Big Brother on Friday? Rylan and Emma Willis delay series predictions until new housemates arrive \nHe said: \"I'm Ray J and you may remember me from my D**K!\" \nRay then added how surprised he is some people still haven't seen his sexual escapades with Kim K. \nHe said: \"Go download it, you'll put some more money in my pocket!\" Stacy Francis enters the Celebrity Big Brother House (Photo: WireImage) \nAll Stars Heidi, Spencer, Coleen, James, Jasmine, Austin and Calum decided the fate of their fellow CBB contestants as the show really kicked off. \nThe All Star contestants were tasked with choosing who should be \"edited out\" of the show. \nThey settled on Stacy, banishing her out into the garden as the others enjoyed the launch party. Stacy was also told to wear a beige hoodie and tracksuit set and that she would be missing out on any of the big events. \nThe drama has only just begun.", "external_links": [], "published": "2017-01-04T09:00:00.000+02:00", "crawled": "2017-01-04T04:33:10.430+02:00", "highlightTitle": ""}