{"organizations": [], "uuid": "2f11aca50283e028827a66594deee8c9b9f83401", "thread": {"social": {"gplus": {"shares": 3}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 23}, "facebook": {"likes": 891, "shares": 891, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bbc.co.uk", "main_image": "http://ichef.bbci.co.uk/news/1024/cpsprodpb/CA49/production/_93258715_mediaitem-93042898.jpg", "site_section": "http://newsrss.bbc.co.uk/rss/newsonline_uk_edition/front_page/rss.xml#", "section_title": "BBC News - Home", "url": "http://www.bbc.co.uk/news/disability-38027203", "country": "GB", "domain_rank": 108, "title": "Dog-cam", "performance_score": 8, "site": "bbc.co.uk", "participants_count": 0, "title_full": "Dog-cam", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-04T17:33:00.000+02:00", "replies_count": 0, "uuid": "2f11aca50283e028827a66594deee8c9b9f83401"}, "author": "", "url": "http://www.bbc.co.uk/news/disability-38027203", "ord_in_thread": 0, "title": "Dog-cam", "locations": [], "entities": {"persons": [{"name": "beth rose", "sentiment": "negative"}, {"name": "kika", "sentiment": "none"}, {"name": "amit patel", "sentiment": "none"}, {"name": "seema", "sentiment": "none"}, {"name": "patel", "sentiment": "none"}, {"name": "amit", "sentiment": "none"}], "locations": [{"name": "kika", "sentiment": "none"}, {"name": "trafalgar square", "sentiment": "none"}, {"name": "new eltham", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "bbc news", "sentiment": "negative"}, {"name": "kika", "sentiment": "none"}, {"name": "network rail", "sentiment": "none"}, {"name": "new eltham high street", "sentiment": "none"}, {"name": "university college hospital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The guide dog that spies on people who ignore its owner By Beth Rose BBC News 4 January 2017 Close share panel Media caption Amit Patel's guide dog, Kika, carries a camera which records the discrimination he can't see Unable to see the world around him, Amit Patel fitted his guide dog with a camera and set about recording evidence of the discrimination he faced but could not see. \n\"The city is a scary place. It's like someone put you in the middle of Trafalgar Square, turned you in a circle and said 'find your way home'.\" \nThat is Amit Patel's new reality after he lost his sight unexpectedly in 2012, six months after he got married. \nHe now relies on guide dog Kika to get him around the once familiar streets of London. \nBut the footage captured by his canine guide hasn't always shown a city willing to help him. \n\"The video came out of necessity,\" Patel says. \"Kika was getting hit by peoples' bags and she was getting a lot of abuse. A woman stopped me one day and had a go at me for holding everyone up and said I should apologise, which was a real shock.\" Image copyright Amit Patel \nThe former doctor found a solution - attach a GoPro to Kika's harness and film every journey. Patel's wife, Seema, can then review the footage if it is felt there was something amiss about that day. \nAnd when alterations were made to a London train station the camera came into its own. \n\"I asked for help and no one came,\" Patel recounts. \"The video shows lots of staff standing around me and this one guy looking over many times. \n\"Eventually when the staff member actually came to me the first thing he said was 'sorry I didn't see you' and that really bugged me. He wouldn't say that to someone who wasn't visually impaired. \n\"It really makes me angry. It's the fact that someone is fobbing me off.\" Image copyright Amit Patel Image caption An image from Kika's footage of the Network Rail incident in London \nThe footage was sent to Network Rail giving Patel the \"valuable evidence\" needed to lodge a formal complaint about an incident he couldn't see. \n\"It made me feel vulnerable but having the footage was a godsend,\" he says. \n\"Having the camera, having the voice, having the actual scenario played out in real time it actually gives me something to go back to the company and say 'this is what happened to me and it needs to be sorted'.\" \nThe video had an impact and Network Rail investigated before giving further training to its staff. Image caption Kika's camera captures an image of Amit on the London Underground \n\"While in this instance the event and associated disruption was not organised by or held at the station itself, we do recognise that the station can be a complicated place to navigate,\" a spokesman says. \n\"That is why we have hired many extra staff to look after passengers.\" \nFor newly blind Patel, standing alone for several minutes can feel like hours. \n\"One of the things I noticed with losing my sight is how lonely it is. If I'm travelling by public transport I will be the scared little boy sat in the corner. You can't listen to music because you're listening out for dangers or to station announcements.\" \nPatel says it is only since he lost his sight that he has become aware of the discrimination visually impaired people can face. A sudden loss \nPatel learned he had keratoconus - a condition which changes the shape of the cornea - in the final year of medical school. \nLenses to push the corneas back into shape stopped working and six cornea transplants were rejected by his body until he was told \"no more\". \nIt was a series of burst blood vessels which caused the unexpected loss of sight within 48 hours. \nPatel says: \"I woke up every morning thinking I'd get my sight back. For about six months I was quite shut off, depressed and I would go to the bathroom and have a cry. \n\"The one thing that stayed in my mind was that I would never see my loved ones. It was holding on to the last memories I had.\" \n\"There are taxi drivers who will see you and won't stop. You phone the company and they say they didn't see you, but you look at the footage and see them having looked at you and driving right past.\" \nOther incidents he says highlight a lack of thought - especially on London's Underground. \n\"People assume, because I have a guide dog, I can walk around them but they make us walk near the tracks or I can say to Kika 'find me a seat' and I'll put my hand down on one and someone will sit on it and refuse to get up.\" \nThe loss of his sight led Patel to change his life dramatically. The former University College Hospital doctor moved to New Eltham in south London so his wife didn't have to travel so far for work and wouldn't spend so much time away from him. Image caption The view of New Eltham High Street from Kika's camera \nPatel says he had assumed, as a doctor, he would know where to get support, but he found that wasn't the case and he became frustrated at the simple mistakes he made - miscalculations led to stair falls and fingers were burnt from trying to find out how full his coffee cup was. \nBeyond the major life changes there were more subtle experiences too. \n\"Your balance goes awry. I felt like I walked on a cloud sometimes, and if I find a pair of shoes I'll buy three pairs because a change in grip makes a real difference. \n\"My hearing's increased and my sense of smell, and the way I touch things.\" \nThere have also been more unexpected side effects. Image copyright Amit Patel Image caption The camera has given Amit the confidence to go out alone with Kika and his baby son \n\"I have small pixels of light coming into my eyes and my brain interprets that as images. It'll put four pixels together and build a photo - so you may be sitting on the couch while thinking a car's coming towards you.\" \nPatel now supports people who have lost their sight unexpectedly and gives talks to community organisations using the GoPro footage to demonstrate what Kika sees. \nDespite all the challenges he has faced, including coming to terms with never seeing his baby son, Patel has accepted his new world. \n\"My life at the moment is so much more vivid, it's more colourful than it was when I had sight. \n\"It still fills me with dread leaving the house, because I have no control and am completely reliant on Kika, but we're out all of the time - any excuse.\"", "external_links": [], "published": "2017-01-04T17:33:00.000+02:00", "crawled": "2017-01-04T12:52:00.716+02:00", "highlightTitle": ""}