{"organizations": [], "uuid": "d99dfebc0306f6156c11a47ee7ab5ba2c1d5454f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 206, "shares": 206, "comments": 0}, "stumbledupon": {"shares": 1}}, "site_full": "hellogiggles.com", "main_image": "", "site_section": "http://hellogiggles.com", "section_title": "HelloGiggles", "url": "http://hellogiggles.com/jennifer-lawrence-says-shes-never-new-years-eve-kiss/", "country": "US", "domain_rank": 3916, "title": "Jennifer Lawrence says she’s never had an New Year’s Eve kiss, which is surprising but totally fine", "performance_score": 2, "site": "hellogiggles.com", "participants_count": 1, "title_full": "Jennifer Lawrence says she’s never had an New Year’s Eve kiss, which is surprising but totally fine", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-04T00:02:00.000+02:00", "replies_count": 0, "uuid": "d99dfebc0306f6156c11a47ee7ab5ba2c1d5454f"}, "author": "Kenya Foy", "url": "http://hellogiggles.com/jennifer-lawrence-says-shes-never-new-years-eve-kiss/", "ord_in_thread": 0, "title": "Jennifer Lawrence says she’s never had an New Year’s Eve kiss, which is surprising but totally fine", "locations": [], "entities": {"persons": [{"name": "jennifer lawrence", "sentiment": "negative"}, {"name": "graham norton", "sentiment": "none"}, {"name": "j. law", "sentiment": "none"}, {"name": "lawrence", "sentiment": "none"}, {"name": "seth meyers", "sentiment": "none"}], "locations": [], "organizations": [{"name": "nye", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jennifer Lawrence says she’s never had an New Year’s Eve kiss, which is surprising but totally fine So, you might find this hard to believe but, Jennifer Lawrence hasn’t had a New Year’s Eve kiss . As in, ever, which is totally fine, BTW. Honestly, the pressure to be passionately smooching someone (anyone!) when the clock strikes midnight on NYE is kind of ridiculous. Well, a lot, actually, which is why many of us can understand why Lawrence isn’t exactly into NYE .\nAs The Daily Mail reports, Lawrence made her kissing confession during an appearance on Seth Meyers’ New Year’s Eve special and she didn’t mince words about how she felt about the holiday.\n“I hate it. I hate New Year’s,” she said. “I feel like everybody is chasing a good time.” \n\nShe added,\n“I don’t think I’ve ever had a kiss on New Year’s. I don’t think I’ve ever had a fun time,” Lawrence said. “Yeah poor me.” \nWe’re pretty sure that J. Law isn’t sitting around moping because of her lack of NYE kisses, but for anyone who feels like a lone loser because you’ve never been kissed on New Year’s Eve, please immediately file this thought under Lies You’ve Been Told because it’s simply not true.\n\nThe Passengers star shared a similar sentiment last NYE when she told Graham Norton that she typically ends up “drunk and disappointed.”\nWe feel ya, J. Law. The Year That Must Not Be Named went on record as one of the suckiest ever, so we can totally relate to wanting to enthusiastically celebrate the arrival of a fresh start. However, let’s all agree to adopt a new attitude in 2017 that doesn’t involve beating ourselves up for not partaking in the New Year’s Eve hype.\nBesides, you have the rest of the year to kiss someone and just because it didn’t happen on NYE doesn’t make it any less special.\n", "external_links": [], "published": "2017-01-04T00:02:00.000+02:00", "crawled": "2017-01-03T19:29:33.346+02:00", "highlightTitle": ""}