{"organizations": [], "uuid": "e7e10b67f3fd6171f11240ac99ec452e1f426c3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 8}, "facebook": {"likes": 161, "shares": 161, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "blogs.abc.net.au", "main_image": "", "site_section": "http://blogs.abc.net.au/antonygreen/index.rdf", "section_title": "Antony Green's Election Blog", "url": "http://blogs.abc.net.au/antonygreen/2017/01/2017-western-australian-election-electoral-pendulum.html", "country": "AU", "domain_rank": 1455, "title": "2017 Western Australian Election - Electoral Pendulum", "performance_score": 1, "site": "abc.net.au", "participants_count": 1, "title_full": "2017 Western Australian Election - Electoral Pendulum", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-03T05:25:00.000+02:00", "replies_count": 0, "uuid": "e7e10b67f3fd6171f11240ac99ec452e1f426c3b"}, "author": "Antony Green", "url": "http://blogs.abc.net.au/antonygreen/2017/01/2017-western-australian-election-electoral-pendulum.html", "ord_in_thread": 0, "title": "2017 Western Australian Election - Electoral Pendulum", "locations": [], "entities": {"persons": [{"name": "moore", "sentiment": "none"}, {"name": "barnett", "sentiment": "none"}, {"name": "rob johnson", "sentiment": "none"}], "locations": [{"name": "geraldton", "sentiment": "none"}, {"name": "west swan", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}, {"name": "collie-preston", "sentiment": "none"}, {"name": "wa", "sentiment": "none"}, {"name": "kalgoorlie", "sentiment": "none"}, {"name": "albany", "sentiment": "none"}, {"name": "mandurah", "sentiment": "none"}, {"name": "perth", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "council", "sentiment": "none"}, {"name": "national party", "sentiment": "none"}, {"name": "abc wa election", "sentiment": "none"}, {"name": "liberal mlc", "sentiment": "none"}, {"name": "wa legislative council", "sentiment": "none"}, {"name": "animal justice party", "sentiment": "none"}, {"name": "legislative council", "sentiment": "none"}, {"name": "labor and national parties", "sentiment": "none"}, {"name": "greens", "sentiment": "none"}, {"name": "national", "sentiment": "none"}, {"name": "agricultural region and labor", "sentiment": "none"}, {"name": "labor", "sentiment": "none"}, {"name": "liberal party", "sentiment": "none"}, {"name": "liberal", "sentiment": "none"}, {"name": "abc", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "farmers", "sentiment": "none"}, {"name": "legislative assembly", "sentiment": "none"}, {"name": "legislative assembly totals party", "sentiment": "none"}, {"name": "nat", "sentiment": "none"}, {"name": "lib", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 03, 2017 2017 Western Australian Election - Electoral Pendulum \nThe 2017 Western Australian election will be held on 11 March 2017. It will be conducted on changed electoral boundaries from the 2013 election when the Barnett government was re-elected. \nMy ABC election guide for the election will not be available until the end of January, but below I have set out the electoral pendulum for the 2017 election based on transferring the 2013 election results to match the new boundaries. \nOn the new boundaries the Labor seats of West Swan and Collie-Preston become notional Liberal seats. Both seats are indicated on the pendulum as having a Labor MP. \nRather than traditional two-party contests, several regional electorates are likely to be Liberal versus National contests. For these electorates a two-party margin is indicated, as well as a notional margin between the Liberal and National candidates in brackets. \nSeats marked (+) were seats lost by Labor at the 2013 election. \nIn Hillarys, Rob Johnson was elected as a Liberal in 2013 but will re-contest as an Independent in 2017. \nUsing the new boundaries, the Liberal Party has a notional 32 seats in the 59 seat Legislative Assembly. If the Liberal Party loses three seats then the National Party will hold the balance of power. This would occur with a 2.2% swing to Labor. All opinion polls currently indicate a larger swing to Labor. \nFor a majority Labor government, Labor needs to gain 10 seats on a uniform swing of 10%. The ten seats includes the two notional Liberal seats with sitting Labor MPs. \nA swing of between 2.2% and 10% would most likely deliver the National Party the balance of power, though it would be a significant break with the party's history for the National Party to do other than back the return of a Liberal-led government in those circumstances. \nNorth West Central (NAT 10.5 v LIB) NAT 11.5% Warren-Blackwood (NAT 7.2 v LIB) NAT 15.7% Kalgoorlie (NAT 3.2 v LIB) NAT 16.5% Central Wheatbelt (NAT 8.9 v LIB) NAT 21.5% Geraldton (LIB 10.9 v NAT) LIB 22.8% Moore (NAT 5.9 v LIB) NAT 23.2% Roe (NAT 16.7 v LIB) NAT 27.6% \nFull details of the WA redistribution can be found at this link . \nThe table below sets out the overall votes by party at the 2013 election. 2013 Western Australian Election - Legislative Assembly Totals Party (Candidates) -5.3 \nThe 36 member Legislative Council elected in 2013 consisted of 17 Liberal members, 5 National, 11 Labor, 2 Green and one Shooters, Fishers and Farmers. \nThe WA Legislative Council is the last remaining malapportioned state chamber with a 3-to-1 weighting in favour of areas outside of metropolitan Perth. With the exception of four remote seats, one-vote one-value electoral boundaries apply in the lower house. In the Legislative Council there are 18 MLCs elected to represent Perth and 18 to represent the rest of the state. This is despite Perth having 75% of the state's population compared to 25% in the rest of the state. As of last September the average enrolment per metropolitan MLC is 66,310 compared to only 22,009 in the rest of the state. \nThe Legislative Council is split into six regions that each elect six MLCs. There are three regions in Perth and three in the rest of the state, region boundaries defined by law to correspond to land use patterns. \nThe South West region runs from Mandurah around the south west corner of the state to Albany and has an average enrolment per MLC of 37,490. \nThe Agricultural Region runs through the wheatbelt from Geraldton to Esperance and has an average enrolment per MLC of 17,141. \nThe Mining and Pastoral Region covers Kalgoorlie and the vast east and north of the state. It has an average enrolment per MLC of 11,395. \nThe regional structure of the Legislative Council was introduced in the 1980s as a deal between the Labor and National Parties. It gave both parties a low quota region where it polled well, the Nationals in Agricultural Region and Labor in Mining and Pastoral Region. \nSince then Labor's vote has collapsed in the state's mining regions and Labor currently holds only one of the six seats in Mining and Pastoral Region. The Nationals currently hold two of the six seats in both the Agricultural and the Mining and Pastoral Regions. The Nationals also hold three lower house seats in both regions. \nAfter the 2005 WA election, Labor and the Greens combined with a disendorsed Liberal MLC to pass one-vote one-value electoral boundaries for the Legislative Assembly. This was achieved by using the 'lame duck' period of the Legislative Council, the period when the old Council remains in place after the election until new MLCs take their seats after 22 May. \nThe Greens would not agree to Labor's proposals to also change the Council, other than to end the former 5 and 7 member Regions and replace them with 6 member regions. This change in numbers further strengthened the weighting in favour of the Agricultural and Mining and Pastoral Regions. \nWith the continuing decline of population in the two remote regions, the weighting in favour of these regions and against the South West and Metropolitan regions will continue to increase. It may be an issue opened for debate after the 2017 election. \nThe Legislative Council is elected using the group voting ticket system that was abandoned ahead of the 2016 Federal election. Voters will have two choices, to accept a single ticket of preferences as lodged by a party, or to number preferences for every candidate below the line. \nAs a result the ABC WA Election site will again have upper house election calculators based on the lodged tickets. \nVoters who number preferences above the line as at the Senate election will have all preferences beyond '1' ignored and the party's lodged ticket of preferences will be used instead. Voters who use the Federal rules where only 12 preferences are required below the line will be casting an informal vote. \nThe 10 parties listed below are currently registered to contest the election Animal Justice Party", "external_links": [], "published": "2017-01-03T05:25:00.000+02:00", "crawled": "2017-01-03T14:08:24.089+02:00", "highlightTitle": ""}