{"organizations": [], "uuid": "3366889f21c498134d12ce93f56a193433ff4bc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 207, "shares": 207, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "itunes.apple.com", "main_image": "http://is5.mzstatic.com/image/thumb/Publication69/v4/30/aa/82/30aa8286-d946-5c79-013e-9396bf730b34/source/1200x630bf.jpg", "site_section": "https://itunes.apple.com/us/rss/toppaidebooks/limit=50/genre=9031/xml", "section_title": "iTunes Store: Top Paid Books in Fiction & Literature", "url": "https://itunes.apple.com/us/book/the-magicians/id357918872?mt=11", "country": "US", "domain_rank": 49, "title": "The Magicians - Lev Grossman", "performance_score": 2, "site": "apple.com", "participants_count": 0, "title_full": "The Magicians - Lev Grossman", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-03T06:31:00.000+02:00", "replies_count": 0, "uuid": "3366889f21c498134d12ce93f56a193433ff4bc2"}, "author": "", "url": "https://itunes.apple.com/us/book/the-magicians/id357918872?mt=11", "ord_in_thread": 0, "title": "The Magicians - Lev Grossman", "locations": [], "entities": {"persons": [{"name": "—a.v. club quentin coldwater", "sentiment": "none"}, {"name": "quentin coldwater", "sentiment": "none"}, {"name": "quentin", "sentiment": "none"}, {"name": "—john green", "sentiment": "none"}, {"name": "—cory doctorow", "sentiment": "none"}, {"name": "c.s. lewis", "sentiment": "none"}, {"name": "syfy", "sentiment": "none"}, {"name": "harry potter", "sentiment": "none"}, {"name": "—joe hill", "sentiment": "none"}, {"name": "j.k. rowling", "sentiment": "none"}, {"name": "grossman", "sentiment": "none"}, {"name": "—george r.r. martin", "sentiment": "none"}], "locations": [{"name": "narnia", "sentiment": "none"}, {"name": "brooklyn", "sentiment": "none"}], "organizations": [{"name": "hogwarts", "sentiment": "none"}, {"name": "time", "sentiment": "none"}, {"name": "coldwater", "sentiment": "none"}, {"name": "brakebills college", "sentiment": "none"}, {"name": "codex", "sentiment": "none"}, {"name": "j.r.r. tolkien", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Book 1, Magicians Trilogy - A Novel Lev Grossman \nThis book is available for download with iBooks on your Mac or iOS device, and with iTunes on your computer. Books can be read with iBooks on your Mac or iOS device. Description \nThe New York Times bestselling novel about a young man practicing magic in the real world, now an original series on Syfy“ The Magicians is to Harry Potter as a shot of Irish whiskey is to a glass of weak tea. . . . Hogwarts was never like this.” —George R.R. Martin “Sad, hilarious, beautiful, and essential to anyone who cares about modern fantasy.” —Joe Hill “A very knowing and wonderful take on the wizard school genre.” —John Green “ The Magicians may just be the most subversive, gripping and enchanting fantasy novel I’ve read this century.” —Cory Doctorow “This gripping novel draws on the conventions of contemporary and classic fantasy novels in order to upend them . . . an unexpectedly moving coming-of-age story.” —The New Yorker “The best urban fantasy in years.” —A.V. Club Quentin Coldwater is brilliant but miserable. A high school math genius, he’s secretly fascinated with a series of children’s fantasy novels set in a magical land called Fillory, and real life is disappointing by comparison. When Quentin is unexpectedly admitted to an elite, secret college of magic, it looks like his wildest dreams have come true. But his newfound powers lead him down a rabbit hole of hedonism and disillusionment, and ultimately to the dark secret behind the story of Fillory. The land of his childhood fantasies turns out to be much darker and more dangerous than he ever could have imagined. . . .The prequel to the New York Times bestselling book The Magician King and the #1 bestseller The Magician's Land , The Magicians is one of the most daring and inventive works of literary fantasy in years. No one who has escaped into the worlds of Narnia and Harry Potter should miss this breathtaking return to the landscape of the imagination. From the Trade Paperback edition. From Publishers Weekly Jun 01, 2009 – Harry Potter discovers Narnia is real in this derivative fantasy thriller from Time book critic Grossman (Codex). Quentin Coldwater, a Brooklyn high school student devoted to a children’s series set in the Narnia-like world of Fillory, is leading an aimless existence until he’s tapped to enter a mysterious portal that leads to Brakebills College, an exclusive academy where he’s taught magic. Coldwater, whose special gifts enable him to skip grades, finds his family’s world “mundane and domestic” when he returns home for vacation. He loses his innocence after a prank unintentionally allows a powerful evil force known only as the Beast to enter the college and wreak havoc. Eventually, Coldwater’s powers are put to the test when he learns that Fillory is a real place and how he can journey there. Genre fans will easily pick up the many nods to J.K. Rowling and C.S. Lewis, not to mention J.R.R. Tolkien in the climactic battle between the bad guy and a magician. 5-city author tour. © Publishers Weekly", "external_links": [], "published": "2017-01-03T06:31:00.000+02:00", "crawled": "2017-01-03T02:35:52.946+02:00", "highlightTitle": ""}