{"organizations": [], "uuid": "d0e0e882408eaa1419c91dfddc2766a5a1747b97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 249, "shares": 249, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nfl.com", "main_image": "http://static.nfl.com/static/content/public/photo/2017/01/02/0ap3000000768659_thumbnail_200_150.jpg", "site_section": "http://heresalink.com/rss", "section_title": "(no title)", "url": "http://www.nfl.com/news/story/0ap3000000768658/article/bengals-qb-aj-mccarron-ready-for-offseason-trade", "country": "GB", "domain_rank": 992, "title": "Bengals QB AJ McCarron ready for offseason trade", "performance_score": 2, "site": "nfl.com", "participants_count": 0, "title_full": "Bengals QB AJ McCarron ready for offseason trade", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-03T05:54:00.000+02:00", "replies_count": 0, "uuid": "d0e0e882408eaa1419c91dfddc2766a5a1747b97"}, "author": "", "url": "http://www.nfl.com/news/story/0ap3000000768658/article/bengals-qb-aj-mccarron-ready-for-offseason-trade", "ord_in_thread": 0, "title": "Bengals QB AJ McCarron ready for offseason trade", "locations": [], "entities": {"persons": [{"name": "rosenthal", "sentiment": "negative"}, {"name": "lewis", "sentiment": "negative"}, {"name": "mccoy", "sentiment": "negative"}, {"name": "aj mccarron", "sentiment": "negative"}, {"name": "marvin", "sentiment": "negative"}, {"name": "hue jackson", "sentiment": "none"}, {"name": "andy dalton", "sentiment": "none"}, {"name": "paul dehner", "sentiment": "none"}, {"name": "jackson", "sentiment": "none"}, {"name": "mccarron", "sentiment": "none"}], "locations": [{"name": "cincinnati", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}], "organizations": [{"name": "bengals", "sentiment": "negative"}, {"name": "browns", "sentiment": "none"}, {"name": "nfl", "sentiment": "none"}, {"name": "steelers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Rosenthal: McCoy firing adds to S.D.'s uncertainty \n\"Like I told Marvin (Lewis) and all my coaches in my exit meetings, I appreciate everybody in this organization,\" McCarron continued. \"I really do. From the bottom of my heart. They gave me a chance when a lot of people wouldn't. \n\"They all treated me unbelievably and I really do care for every one of 'em and respect all 'em. This place will always have a special place in my heart just for what they've done for me. I really appreciated it.\" \nMcCarron made it clear that he's ready to move on to the next chapter of his life as a starting quarterback, stating \"I want a chance to play.\" \nA trade is already baked into the team's \" offseason itinerary ,\" according to The Enquirer's Paul Dehner, who added that it's simply a \"matter of when, where and who will provide the most value.\" \nThe Bengals were reluctant to deal McCarron last offseason, Lewis explained at the time, \"because he's exactly what we look for to be a replacement quarterback if we needed it.\" \nThat mindset made sense when McCarron still had two years remaining on a team-friendly rookie contract. Now that the 2014 fifth-round draft pick is entering a contract season, the Bengals seem intent on exploring the market to gauge his value. \nBefore the former Alabama star ever took an NFL snap, Cincinnati's coaching staff arrived at the belief that he was \" fully capable of becoming a starting-quality player .\" \nMcCarron posted a 63.8 completion percentage at 6.7 yards per attempt for a 89.7 passer rating in four starts as Andy Dalton 's stand-in late in the 2015 season. Although he showed initial promise under then-play caller Hue Jackson, he failed to convert a single third down in the regular-season finale and was shut out for three quarters in the rain as the Bengals lost a memorable playoff bout with the Steelers . \nIf McCarron is indeed shopped around the league, a reunion with Jackson would seem to be the most likely scenario. Cleveland's coach maintains a close relationship with Lewis and other members of Cincinnati's front office. The Browns have stockpiled 11 picks in the 2017 NFL Draft , providing plenty of ammo in trade talks. \nPerhaps most importantly, McCarron spent two years mastering Jackson's offense. After overseeing a parade of mistake-prone quarterbacks in his debut season, Jackson might just view McCarron as a competent bridge to the next franchise savior under center.", "external_links": [], "published": "2017-01-03T05:54:00.000+02:00", "crawled": "2017-01-03T02:13:32.616+02:00", "highlightTitle": ""}