{"organizations": [], "uuid": "ba750814245f1883a42675095d1b636ce8cbcbe6", "thread": {"social": {"gplus": {"shares": 5}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 694, "shares": 694, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2016/12/22/National-Security/Images/AFP_JC8XN-0575.jpg", "site_section": "http://www.washingtonpost.com/blogs/plum-line/", "section_title": "The Plum Line - The Washington Post", "url": "https://www.washingtonpost.com/opinions/trump-and-conways-transition-of-contradictions/2017/01/02/41250efc-d10c-11e6-945a-76f69a399dd5_story.html", "country": "US", "domain_rank": 177, "title": "Trump and Conway’s transition of contradictions", "performance_score": 6, "site": "washingtonpost.com", "participants_count": 6, "title_full": "Trump and Conway’s transition of contradictions - The Washington Post", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-02T02:00:00.000+02:00", "replies_count": 5, "uuid": "ba750814245f1883a42675095d1b636ce8cbcbe6"}, "author": "washingtonpost blogs", "url": "https://www.washingtonpost.com/opinions/trump-and-conways-transition-of-contradictions/2017/01/02/41250efc-d10c-11e6-945a-76f69a399dd5_story.html", "ord_in_thread": 0, "title": "Trump and Conway’s transition of contradictions", "locations": [], "entities": {"persons": [{"name": "conway", "sentiment": "negative"}, {"name": "kellyanne conway", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "jennifer rubin", "sentiment": "none"}, {"name": "valerie strauss", "sentiment": "none"}, {"name": "dana milbank", "sentiment": "none"}, {"name": "george conway", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "greg sargent", "sentiment": "none"}], "locations": [{"name": "america", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "dc", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "d.c.", "sentiment": "none"}], "organizations": [{"name": "fbi", "sentiment": "none"}, {"name": "new york post", "sentiment": "none"}, {"name": "fox news", "sentiment": "none"}, {"name": "conways", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "post", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "cia", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "January 2 at 4:59 PM Follow @Milbank Three weeks ago, Trump campaign manager Kellyanne Conway sat on stage in a hotel ballroom in Washington and praised President Obama’s handling of the transition.\n“I was always raised to respect the office of the presidency and its current occupant, and I think that I have done that over the course of my adult life,” she said. She added that Obama “has been incredibly supportive and gracious . . . in wanting this peaceful transfer of power in our great democracy.”\nTen days later, Conway took exactly the opposite position.\nShe suggested that the current occupant of the presidency does not sufficiently love America — and was not supporting a peaceful transition. Her reason: Obama hadn’t silenced talk, based on findings of the CIA and FBI, that Russia meddled in the election to aid Trump.\n“If you want to shut this down and you actually love the country enough to have this peaceful transition in our great democracy between the Obama administration and the Trump administration, there are a couple people in pretty prominent positions, ones named Obama, ones named Hillary Clinton, since it’s people trying to fight over her election still, they can shut this down,” Conway asserted on Fox News .\n[ Kellyanne Conway is playing the ‘woman card’ all wrong ]\nHow did she go, in the space of 10 days, from praising Obama’s handling of the transition to questioning his patriotism? It would appear Conway shares her boss’s epistemological views: The definition of truth is the last thing to come out of one’s mouth.\nConway ended her speech three weeks ago with a plea for others to follow Obama’s example of national unity. She invoked Trump’s victory speech pledging to be “president for all Americans,” not just those who voted for him.\nThat was admirable, but here’s what Trump tweeted Dec. 31: “Happy New Year to all, including to my many enemies and those who have fought me and lost so badly they just don’t know what to do. Love!”\nTo have some hope of unity there needs to be some measure of honesty. You can’t praise Obama’s handling of the transition and then accuse him of not loving America. You can’t promise to be the president for all Americans and then taunt the 54 percent of Americans who didn’t vote for you.\nIn that same appearance three weeks ago, Conway made a powerful case against taking a job in the White House. Asked about a recent tweet in which she said “West Wing welcome mat is out” but “mom of four is not in most job descriptions,” Conway elaborated: “My children are 12, 12, 8 and 7, which is bad idea, bad idea, bad idea, bad idea for mom going inside,” she said. “They have to come first and these are very fraught ages.” Though she said she would do whatever Trump wanted, she said she told male colleagues “there are limits” to a mother’s role. “They say I ‘may have four kids, but.’ I said there’s nothing that comes after the ‘but’ that makes any sense to me. So don’t even try. What is the but? . . . Nobody will brush their teeth again?”\nShe said the choice was different for fathers, noting that she told male colleagues “the question isn’t would you take the job” but “would you want your wife to? Would you want the mother of your children to?” Though she liked the notion of helping women feel “less guilty about balancing life and career,” she mocked the idea that she could work in the White House and still slip out to help the kids with homework.\nTwo weeks later, the announcement came that Conway would be working in the White House after all, as counselor to the president. Lately there are reports that her husband, George Conway, is on the short list to be solicitor general, the top Justice Department litigator.\nNow that Conway is Washington-bound, she’s picking a fight with local private schools with a familiar campaign of contradictions. She spoke to the New York Post last week for an item reporting her fear that “establishment elites in Washington, DC, are so prejudiced against President-elect Donald Trump that she won’t be able to get her kids into private school.”\nThe item went on: “While in DC on Wednesday with her kids looking at schools,” Conway said friends’ inquiries were met with “silence and sighs.”\nBut my Post colleague Valerie Strauss followed up with Conway and discovered that Conway was in Florida with Trump on the Wednesday she was supposedly with her kids looking at D.C. schools, which were closed for winter recess. And the “silence and sighs”? The allegedly negative reaction was experienced by precisely one colleague on exactly one call, unsolicited by the Conways.\nTwitter: @Milbank\nRead more from Dana Milbank’s archive , follow him on Twitter or subscribe to his updates on Facebook .\nRead more about this topic:\nDana Milbank: Trump’s one consistent policy: Chaos\nGreg Sargent: Yes, Donald Trump ‘lies.’ A lot. And news organizations should say so.\nJennifer Rubin: Trump’s inability to tolerate critics may be his biggest problem", "external_links": ["https://twitter.com/Milbank", "https://twitter.com/KellyannePolls/status/804487600505520128", "http://www.politico.com/story/2016/12/kellyanne-conway-obama-clinton-transition-232735", "http://www.facebook.com/danamilbank", "https://twitter.com/@Milbank", "http://www.nbcnews.com/politics/politics-news/husband-kellyanne-conway-short-list-solicitor-general-sources-n701701", "https://twitter.com/realDonaldTrump/status/815185071317676033"], "published": "2017-01-02T02:00:00.000+02:00", "crawled": "2017-01-03T02:25:33.864+02:00", "highlightTitle": ""}