{"organizations": [], "uuid": "8ca8452fb1d8fce5df545b03d2431d17b2ab5867", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 1}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 313, "shares": 313, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.startribune.com", "main_image": "http://stmedia.stimg.co/ows_148331768397655.jpg?h=630&amp;w=1200&amp;fit=crop&amp;bg=999&amp;crop=faces", "site_section": "http://www.startribune.com/variety/index.rss2", "section_title": "Variety", "url": "http://www.startribune.com/his-side-hustle-this-minnesota-professional-earns-extra-money-shoveling-snow/409219335/", "country": "US", "domain_rank": 4035, "title": "His side hustle? This Minnesota professional earns extra money shoveling snow", "performance_score": 3, "site": "startribune.com", "participants_count": 0, "title_full": "His side hustle? This Minnesota professional earns extra money shoveling snow", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-02T22:28:00.000+02:00", "replies_count": 0, "uuid": "8ca8452fb1d8fce5df545b03d2431d17b2ab5867"}, "author": "", "url": "http://www.startribune.com/his-side-hustle-this-minnesota-professional-earns-extra-money-shoveling-snow/409219335/", "ord_in_thread": 0, "title": "His side hustle? This Minnesota professional earns extra money shoveling snow", "locations": [], "entities": {"persons": [{"name": "jared goyette", "sentiment": "none"}], "locations": [{"name": "minnesota", "sentiment": "none"}, {"name": "philadelphia", "sentiment": "none"}, {"name": "minneapolis", "sentiment": "none"}, {"name": "maple grove", "sentiment": "none"}, {"name": "midwest", "sentiment": "none"}], "organizations": [{"name": "afp", "sentiment": "none"}, {"name": "buddhist", "sentiment": "none"}, {"name": "guardian", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "His side hustle? This Minnesota professional earns extra money shoveling snow Shoveling isn't easy, but the work reminds him where he came from. By Jared Goyette Special to the Star Tribune January 2, 2017 — 9:28am   Like a lot of Minnesota residents, I check the weather forecast often at this time of year, but I have better reasons than most. My rent check depends on it. I shovel snow for a living. The company I work for gives us notice a few days ahead of time via a mass text message. “Respond yes if you are available on Sunday at midnight,” a typical message might read. You have to think carefully before answering because it’s not a light commitment. I’ve never worked a shift that was less than nine hours, and it’s common to go for 15 or more, usually overnight and into the early hours of the morning. You feel it the next day, too. My hands hurt the day after a shift, and sometimes my back does, too. But the hardest part is dealing with the sleep deprivation and the toll it takes on body and mind. I’m a freelance journalist. There are other side gigs I could take besides shoveling snow in the middle of the night in the dead of a Minnesota winter, but this job suits me for a few reasons. I grew up with it. The first time I worked as a shoveler, I was probably around 16 or 17, working with my half-brother. He worked for a company that had contracts for convenience stores and corporate headquarters in the western suburbs of Philadelphia, where we grew up. My brother wasn’t a very talkative person, but we got to know each other in the cab of his pickup truck, talking and arguing over what to play on the radio. I eventually moved south, and stopped doing snow work. But when he died this year of a heroin overdose , yet another “White Working Class male” who got hooked on opioid painkillers and then dope, I decided to start again. This winter was the first time I shoveled without him. I think in some ways it reminds me of him and where we come from. And, honestly, I need the money. My daughter just turned 7, I like to send her mom as much money as I can. Snow shoveling pays well, at $15 to $20 an hour, depending on experience. The money and the low bar of entry draws a diverse crowd you wouldn’t find together in another setting: office workers looking for extra cash, guys recently out on parole or treatment centers, migrant workers, middle-age dads, vagabond kids in their early 20s who left small towns in other parts of the Midwest. Once an actor showed up, looking for work between auditions. As he filled out the form, he asked one of the supervisors, “Did you happen to get my résumé? I e-mailed it to you.” To which the supervisor replied: “Dude, I don’t know if you’ve realized it yet, but you’re just shoveling snow.” Yes, it’s hard work. You’re scraping, pushing and lifting snow, but it can be meditative. Once this winter I was with a crew at a mammoth outlet mall in the northern suburbs of Minneapolis. We had “snow rakes” or a kind of aluminum hoe at the end of a 12-foot pole that we use to pull snow from store awnings. It was about 2 a.m. when we started. The line of stores stretched about a quarter mile into the distance. I grabbed one of the poles and started with one group. I lifted it up, and pulled down, sending white chunks crashing to the pavement below. A guy behind me used a shovel to push the piles off the sidewalk and into the street, where a plow would clear them later. The motion was repetitive: Lift up, pull down, step to the side, lift up, pull down, step to the side, and so on. The foreman stopped by and said I was missing some near the top, where the awning connected with the wall. He watched me do it, and said to approach it more from the side, so the rake wouldn’t push the snow against the wall. I went back at it, the sound of metal scraping against metal and ice filling my ears. In that moment I found myself thinking of a Buddhist concept called “beginner’s mind,” something I first learned from a meditation app called Headspace. I tried to think of every pull of that pole as if it were the first time I was doing it, and to be genuinely curious about how much snow I could get. I lifted the pole, guided the rake in sideways, felt it touch the wall, and then pulled, letting the momentum carry it down. My day job as a writer is inherently cerebral, and set up against a backdrop of constant anxiety. I’m always waiting to hear back from editors on pitches, or from sources on stories. It’s hard to know how much money you’ll make by the end of the month. You read, you pitch, and you hope it works out. It’s a relief to forget about that for a night and just let my body do the work. An hour went by, then two, then three. My arms ached. I was sweating under my jacket. When I reached the end of my section, I looked back and realized how far I’d come. There is no need for hand-wringing about “impact” in this job, no need to doubt what you’ve done. You can see it. And if you can’t, that means you’re not finished. I asked a guy driving a Bobcat where to go next. We switched to Spanish. “Vete por el otro lado,” he said. Go to the other side. I started my walk across the long, icy parking lot, a gust of wind pushing me back as I made my way to join another crew. Jared Goyette is a freelance journalist based in Minneapolis who writes for the Guardian, AFP and other outlets. He posts frequently on Instagram stories and was recently made a shovel foreman at Showcase Landscape in Maple Grove.", "external_links": [], "published": "2017-01-02T22:28:00.000+02:00", "crawled": "2017-01-03T02:56:22.644+02:00", "highlightTitle": ""}