{"organizations": [], "uuid": "95bc6770996d8450221244c0c84b372fddfa50b4", "thread": {"social": {"gplus": {"shares": 2}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 7}, "facebook": {"likes": 253, "shares": 253, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessinsider.com", "main_image": "http://static1.businessinsider.com/image/5835e464ba6eb619268b5cd5-1190-625/the-world-needs-to-stop-obsessing-over-how-many-cars-tesla-is-selling.jpg", "site_section": "http://www.businessinsider.com/clusterstock", "section_title": "Finance - Business Insider", "url": "http://www.businessinsider.com/the-world-needs-to-stop-obsessing-over-how-many-cars-tesla-is-selling-2017-1", "country": "US", "domain_rank": 283, "title": "The world needs to stop obsessing over how many cars Tesla is selling", "performance_score": 2, "site": "businessinsider.com", "participants_count": 1, "title_full": "The world needs to stop obsessing over how many cars Tesla is selling - Business Insider", "spam_score": 0.001, "site_type": "blogs", "published": "2017-01-04T17:38:00.000+02:00", "replies_count": 0, "uuid": "95bc6770996d8450221244c0c84b372fddfa50b4"}, "author": "Matthew DeBord", "url": "http://www.businessinsider.com/the-world-needs-to-stop-obsessing-over-how-many-cars-tesla-is-selling-2017-1", "ord_in_thread": 0, "title": "The world needs to stop obsessing over how many cars Tesla is selling", "locations": [], "entities": {"persons": [{"name": "tesla", "sentiment": "negative"}, {"name": "musk", "sentiment": "none"}, {"name": "elon musk tesla", "sentiment": "none"}, {"name": "reuters/james glover", "sentiment": "none"}, {"name": "elon musk", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "earth", "sentiment": "none"}, {"name": "tesla", "sentiment": "none"}], "organizations": [{"name": "ford", "sentiment": "none"}, {"name": "gm", "sentiment": "none"}, {"name": "tesla motors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tesla's California factory. Benjamin Zhang/Business Insider See Also Tesla is about to repeat history — and that's not a good thing Tesla is going to have answer a question it's never been asked before For the first time in its history, Tesla delivered more than 50,000 cars in one year\nOn Tuesday, Tesla reported how many vehicles it built and, more importantly for investors, how many were delivered to customers during the fourth quarter of 2016 and in the full year.\nOn paper, the numbers were disappointing: Tesla missed its deliveries guidance for the year by around 4,000 vehicles, after indicating that it would deliver between 80-90,000 for much of 2016.\nIt became apparent midway through last year that Tesla probably wasn't going to hit the upper end of guidance, and in fact the company admitted as much be trimming back its guidance to 50,000 for the second half. But it also fell short of that number.\nAll these numbers should be taken with a grain of salt, however. Tesla produced enough vehicles during the year to meet its guidance, over 80,000, a substantial increase over 2015's total. The carmaker just couldn't get them to customers.\n2 key problems Tesla has two key problems on this front. First, it's still a small automaker. Yearly production is what a major automaker might churn out in a month. This makes for issues when Tesla has to export US-made vehicles to markets abroad: the company has to wait for the boat to be full of stuff, other companies' stuff, before its cars can leave port.\nSecond, Tesla has no dealers, so unlike every other automaker on the planet, it has to wait until a customer officially signs the paperwork and takes possession of a vehicle before it can count a delivery.\nA GM or a Ford can register a sale as soon as a vehicle leaves a factory because the customer has already \"paid\" — that customer is a dealer, and that dealer has often paid by having the automaker lend him or her money to establish inventory, a practice that in the industry is known as \"floor plan financing.\"\nAt times, this means that although the carmakers have booked a sale, the vehicle is sitting on a dealer lot, languishing in inventory and compelling automakers to curtail production.\nTesla Motors CEO Elon Musk. REUTERS/James Glover II\nAs someone who advocated for greater transparency from Tesla on deliveries before the company started releasing the quarterly totals — big carmakers report their sales each month, as they're doing on Wednesday — I now think investors and industry experts are paying too much attention to this metric.\nHere's why. Tesla obviously doesn't have any issues around demand. It received almost 400,000 pre-orders for its Model 3 when the vehicle was revealed in early 2016, almost a full two years before the actually car would be available to buy. At its current rate of production, it should be able to double 2016's output in 2017 — and globally there should be no shortage of people who want to pay up for cars, regardless of how long they have to wait.\nThis is an enviable position for any business to be in, much less one that sells its products for $100,000 each. Tesla, by the way, has created this level of demand without ever doing any significant marketing or advertising. The big automakers, by contrast, are some of the largest advertisers to ever walk the Earth, spending billions annually to get the word out.\nAn unhealthy fixation Nearly 400,000 pre-orders for the Model 3 rolled in after it was unveiled. AP Photo/Justin Pritchard\nThe fixations on Tesla's delivery numbers has arisen due to the company's elevated stock price and market cap. Simply put, a lot of Tesla investors and the investment-banking analysts who guide them are boxed into a growth thesis that's dispiritingly information starved much of the time.\nThere's also a notable amount of short interest in Tesla, understandably, and those shorts need something to trade on.\nAt a macro level, Tesla is succeeding — it's the first successful new American car company to come along in decades, and its success is all the more remarkable because it's achieved it with an alternative propulsion system, in an economic environment where electric cars have managed to capture only about 1% of worldwide sales.\nSo the only way to evaluate how Tesla is doing it to take a long view and focus on the milestones: the vehicles launches and the year-over-year improvements, as well as the overall progress of the global shift from fossil-fuel power to renewable energy. This approach is the opposite of how many fast-growth companies and even plenty of established ones are considered; with them, it's quarter-by-quarter, relentlessly.\nTesla is the ultimate big-picture firm: If the big picture doesn't continue to come into focus, the company fails. But you have to be thinking big to even start looking.\nLet's say Tesla doesn't fail, and that it becomes an important mobility provider in the future, on a par with a GM or Toyota today.\nIf that happens, no one will care if Tesla delivered 80,000 vehicles in 2016 or 800,000. The question will be: Did it produce and sell enough cars to keep the story going?\nIn this sense, the 2016 production and deliveries totals are outstanding. The company is on the road to a 100,000-vehicles production pace in 2017, and after 100,000 comes 200,000, and don't forget that Musk says the automaker will hit 500,000 by 2018.\nThat's the most important number Tesla has in front of it. What happens between now and then, as long as production doesn't fall back and demand doesn't evaporate, is noise, and we should start to discount its importance.\nSEE ALSO: 2017 will be Tesla's biggest year ever — here's what's in store for the company NOW WATCH: Tesla reveals how your self-driving car sees the road Loading video... More: Tesla Take BITranspo Elon Musk Tesla", "external_links": [], "published": "2017-01-04T17:38:00.000+02:00", "crawled": "2017-01-04T16:46:30.501+02:00", "highlightTitle": ""}