{"organizations": [], "uuid": "5265252ea53e964740c2ae77b3f58f1dd6a03bf2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 144, "shares": 144, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://nnimgt-a.akamaihd.net/transform/v1/crop/frm/silverstone-feed-data/7ccd5fa1-05de-4f10-9e72-a591c15c5902.jpg/r1_0_727_410_w1200_h678_fmax.jpg", "site_section": "http://www.queenslandcountrylife.com.au/rss.xml", "section_title": "Queensland Country Life - News", "url": "http://www.smh.com.au/federal-politics/political-news/ensure-better-access-to-bush-doctors-before-private-health-changes-ama-20170103-gtl72k.html", "country": "AU", "domain_rank": 1534, "title": "Ensure better access to bush doctors before private health changes: AMA", "performance_score": 1, "site": "smh.com.au", "participants_count": 1, "title_full": "Ensure better access to bush doctors before private health changes: AMA", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-03T10:38:00.000+02:00", "replies_count": 0, "uuid": "5265252ea53e964740c2ae77b3f58f1dd6a03bf2"}, "author": "Amy Remeikis", "url": "http://www.smh.com.au/federal-politics/political-news/ensure-better-access-to-bush-doctors-before-private-health-changes-ama-20170103-gtl72k.html", "ord_in_thread": 0, "title": "Ensure better access to bush doctors before private health changes: AMA", "locations": [], "entities": {"persons": [{"name": "sussan ley", "sentiment": "negative"}, {"name": "tony bartone", "sentiment": "none"}, {"name": "bartone", "sentiment": "none"}, {"name": "louise kennerley the turnbull", "sentiment": "none"}], "locations": [], "organizations": [{"name": "ama", "sentiment": "negative"}, {"name": "private health ministerial advisory committee", "sentiment": "none"}, {"name": "australian medical association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Aa A spokeswoman for Health Minister Sussan Ley said it was one proposal under consideration. Photo: Louise Kennerley The Turnbull government may be looking at ways to get more regional and rural Australians into private health cover, but the nation's peak medical body says the priority should be more access to medical services, and more support and infrastructure for bush doctors. A proposal floated at a roundtable with rural and regional stakeholders last month would see health fund members living outside cities paid larger insurance subsidies in a bid to counterbalance the lack of easy access to specialist services. The Australian reported the meeting found \"some support\" for higher private health insurance for those in the bush. A spokeswoman for Health Minister Sussan Ley said it was one proposal under consideration by the Private Health Ministerial Advisory Committee. \"Minister Ley is supportive of initiatives which encourage Australians living in rural and remote areas to take up and maintain private health insurance,\" she said. \"That's why the Turnbull government made an election commitment to ensure that Australians living in rural and remote areas get better value from their private health insurance.\" But vice president of the Australian Medical Association Tony Bartone said making sure there was easy access to services was a higher priority. \"We'll wait for the detail on this - essentially any proposal that looks at differential rebates is not one that we would have supported in the past, but we will wait to see the details on this one,\" he said. \"But it's about access, access to services and having the appropriately trained rural workforce available. \"Just addressing private health insurance, even though it is an admirable initiative, the issue is there is no private health facilities available or a private health specialist available in the immediate area for people to access in the first place.\" Dr Bartone said what was needed was investment in rural and regional facilities and ensuring the appropriately trained workforce was available. \"There is a shortage of both GPs and specialists in these areas – it is not just an issue of cost, it is an issue of availability of locum relief, infrastructure – there is a whole lot of issues that need addressing first and foremost,\" he said. The committee is due to report back to the government with its final recommendations next month.", "external_links": [], "published": "2017-01-03T10:38:00.000+02:00", "crawled": "2017-01-03T07:58:56.117+02:00", "highlightTitle": ""}