{"organizations": [], "uuid": "107dabf99f5c1b3ed3607f58b8bd40391d2d7cd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 483, "shares": 483, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.avclub.com", "main_image": "http://i.onionstatic.com/avclub/6157/00/16x9/1200.jpg", "site_section": "http://www.avclub.com/feed/rss/?feature_types=newswire", "section_title": "The A.V. Club", "url": "http://www.avclub.com/article/ridley-scotts-turned-down-superhero-movies-because-247823", "country": "US", "domain_rank": 1920, "title": "Newswire: Ridley Scott’s turned down superhero movies because of their “non-reality”", "performance_score": 4, "site": "avclub.com", "participants_count": 1, "title_full": "Newswire: Ridley Scott’s turned down superhero movies because of their “non-reality”", "spam_score": 0.0, "site_type": "blogs", "published": "2017-01-03T05:02:00.000+02:00", "replies_count": 0, "uuid": "107dabf99f5c1b3ed3607f58b8bd40391d2d7cd0"}, "author": "Sam Barsanti", "url": "http://www.avclub.com/article/ridley-scotts-turned-down-superhero-movies-because-247823", "ord_in_thread": 0, "title": "Newswire: Ridley Scott’s turned down superhero movies because of their “non-reality”", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jan 2, 2017 4:02 PM Photo: Getty Images, David M. Benett Photo: Getty Images, David M. Benett Share Tweet \nIf there’s one thing you can say about Ridley Scott other than “ Alien and Blade Runner were really good,” it’s that his movies are always steeped in realism. Yes, the man who directed the movie where the scientists run away from the crashing spaceship instead of just sidestepping it really knows a thing or two about believable storylines where characters make well-informed decisions that are fully consistent with who they are. (Alright, The Martian was all about a guy using reasonably accurate science to survive on Mars, but that shouldn’t distract from our gentle ribbing here.) \nAs a matter of fact, Scott’s dedication to realism is actually the precise reason why he hasn’t made any superhero movies. According to Digital Spy , he recently revealed that superhero movies are “not [his] kind of thing,” and that studios have asked him “several times” to direct one, but he just “can’t believe the thin, gossamer tightrope of the non-reality of the situation of the superhero.” He admits that Blade Runner is kind of a comic strip and that Superman or Batman would almost work in that world, but he’d have “a fucking good story” instead of “no story.” \nRather than recognizing that he could put his money where his mouth is and just make a good superhero movie himself, though, Scott simply bemoans that “cinema mainly is pretty bad” these days. He hopes to continue making “smart films,” but he’s also concerned that the general dumbification of the movie industry will eventually prevent him from doing that. (Again, this is the guy who made Prometheus .) \n ", "external_links": [], "published": "2017-01-03T05:02:00.000+02:00", "crawled": "2017-01-03T00:10:40.009+02:00", "highlightTitle": ""}